export const JavshanItem = [
  {
    id: 1,
    firstText: "Аллахумма иннии ас'алука би асмааика",
    javshantext: `
Йаа Аллах
Йаа Рахмаан
Йаа Рахиим
Йаа ЪАлиим
Йаа Халиим
Йаа ЪАзиим
Йаа Хакиим
Йаа Кодиим
Йаа Мукиим  
Йаа Кариим`,
    secondText:
      "Субхаанака йаа лаа илааhа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id: 2,
    firstText: "",
    javshantext: `
  Иаа Саййидас-саадаат
  Йаа Мужиибад-даъваат
  Иаа Валиййал-хасанаат
  Иаа Рафиъад-даражаат
  Йаа ЪАзиимал-баракаат
  Йаа Гоофирал-хатииаат
  Иаа Даафиъал-балиййаат
  Йаа Саамиъал-асваат
  Йаа Муътыйал-масуулаат
  Йаа ЪАалимас-сирри вал - хофиййаат
  `,
    secondText:
      "Субхаанака йаа лаа илааhа иллаа антал амаанал амаана холлиснаа минан-наар",
  },

  {
    id: 3,
    firstText: "Аллахумма иннии ас'алука би асмааика",
    javshantext: `
  Иаа Хойрол Гоофириин
  Йаа Хойрон-Наасыриин
  Йаа Хойрол Фаатихиин
  Иаа Хойрол Хаакимиин
  Йаа Хойрол Ваарисиин
  Йаа Хойроз-Заакириин
  Иаа Хойрор-Роозикиин
  Иаа Хойрол Хаамидиин
  Йаа Хойрол Мухсиниин
  Иаа Хойрол Фаасылиин
`,
    secondText:
      "Субхаанака йаа лаа илааhа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id: 4,
    firstText: "",
    javshantext: `
  Йаа Ман лахул-ъиззу вал-жамаал
  Йаа Ман лахул-мулку вал-жалаал
  Иаа Ман лахул-кудрату вал-камаал
  Йаа Ман хувал-кабиирул-мутаъаал
  Йаа Ман хува шадиидул-михаал
  Йаа Ман хува шадиидул-ъикооб
  Иаа Ман хува сарииъул-хисааб
  Иаа Ман хува ъиндаху хуснус-савааб
  Йаа Ман хува ъиндаху уммул-китааб
  Йаа Ман хува йуншиус-сахаабас-сикаал
  `,
    secondText:
      "Субхаанака йаа лаа илааhа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id: 5,
    firstText: "Ва ас'алука би асмааика",
    javshantext: `
  Йаа Ханнаан
  Йаа Маннаан
  Йаа Даййаан
  Йаа Гуфроон
  Йаа Бурхаан
  Йаа Султоон
  Йаа Субхаан
  Йаа Мустаъаан
  Йаа Зал-Манни вал байаан
  Йаа Зал-амаан
  `,
    secondText:
      "Субхаанака йаа лаа илааhа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id: 6,
    firstText: "",
    javshantext: `
  Йаа Ман таваадоъа куллу шайин лиъазаматиh
  Иаа Манистаслама куллу шайин ликудратиh
  Йаа Ман залла куллу шайин лиъиззатиh
  Йаа Ман ходоъа куллу шайин лихайбатиh
  Йаа Манинкоода куллу шайин лимулкатиh
  Йаа Ман даана куллу шайин мин махоофатиh
  Йаа Маниншаккатил-жибаалу мин хошиатиh
  Йаа Ман кооматис-самааваату би амриh
  Йаа Манистакорротил-арду би изниh
  Йаа Ман лаа йаьтадии ъалаа ахли мамлакатиh`,
    secondText:
      "Субхаанака йаа лаа илааhа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id: 7,
    firstText: "",
    javshantext: `
  Йаа Гоофирал хотоойа
  Йаа Каашифал балаайа
  Йаа Мунтахар-рожаайа
  Йаа Мужзилал ъатоойа
  Йаа Ваасиъал хадаайа
  Йаа Роозикол бараайа
  Йаа Коодийал манаайа
  Йаа Саамиъаш-шакаайа
  Йаа Бааъисас-сароойа
  Йаа Мутликол усааро
  `,
    secondText:
      "Субхаанака йаа лаа илааhа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id: 8,
    javshantext: `
  Йаа Зал-хамди вас-санаа
  Йаа Зал-мажди вас-санаа
  Йаа Зал-фахри вал-бахаа
  Йаа Зал-ъахди вал-вафаа
  Йаа Зал-ъафви вар-ридоо
  Йаа Зал-манни вал-ъатоо
  Йаа Зал-фасли вал-кадоо
  Йаа Зал-ъиззати вал-бакоо
  Йаа Зал-жууди ван-наъмаа
  Йаа Зал-фадли вал-аалаа
  `,
    secondText:
      "Субхаанака йаа лаа илааhа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id: 9,
    firstText: "Ва ас'алука би асмааика",
    javshantext: `
  Йаа Мааниъ
  Йаа Даафиъ
  Йаа Наафиъ
  Йаа Саамиъ
  Йаа Роофиъ
  Йаа Соониъ
  Йаа Шаафиъ
  Йаа Жаамиъ
  Йаа Ваасиъ
  Йаа Муусиъ
  `,
    secondText:
      "Субхаанака йаа лаа илааhа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id: 10,
    firstText: "",
    javshantext: `
  Йаа Соониъа кулли маснууъ
  Йаа Хоолико кулли махлуук
  Йаа Роозико кулли марзуук
  Йаа Маалика кулли мамлуук
  Йаа Каашифа кулли макрууб
  Йаа Фаарижа кулли магмуум
  Йаа Раахима кулли мархуум
  Йаа Наасыро кулли махзуул
  Йаа Саатиро кулли маъйууб
  Йаа Малжа-а кулли мазлуум
`,
    secondText:
      "Субхаанака йаа лаа илааhа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id: 11,
    firstText: "",

    javshantext: `
  Йаа ъУддатии ъинда шиддатии
  Йаа Рожааии ъинда мусыйбатии
  Йаа Муунисии ъинда вахшатии
  Йаа Соохибии ъинда гурбатии
  Йаа Валиййии ъинда ниъматии
  Йаа Каашифии ъинда курбатии
  Йаа Гыйаасии ъиндаф-тикоории
  Йаа Малжа-ий ъиндад - тыроории
  Йаа Муъиинии ъинда фазаъии
  Йаа Далиилии ъинда хайротии`,
    secondText:
      "Субхаанака йаа лаа илааhа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id: 12,
    firstText: "",
    javshantext: `
  Йаа ЪАллаамал-гуйууб
  Йаа Гоффаараз-зунууб
  Йаа Саттаарол-ъуйууб
  Йаа Кашшаафал-курууб
  Йаа Мукаллибал-кулууб
  Йаа Музаййинал-кулууб
  Йаа Мунаввирал-кулууб
  Йаа Тобиибал-кулууб
  Йаа Хабиибал-кулууб
  Йаа Аниисал-кулууб
  `,
    secondText:
      "Субхаанака йаа лаа илааhа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id: 13,
    firstText: "Ва ас'алука би асмааика",
    javshantext: `
  Йаа Жалиил
  Йаа Жамиил
  Йаа Вакиил
  Йаа Кафиил
  Йаа Далиил
  Йаа Мукиил
  Йаа Хобиир
  Йаа Латииф
  Йаа ЪАзииз
  Йаа Малиик
  `,
    secondText:
      "Субхаанака йаа лаа илааhа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id: 14,
    firstText: "",
    javshantext: `
  Йаа Далиилал-мутахаййириин
  Йаа Гыйаасал-мустагиисиин
  Йаа Сориихол-мустасрихиин
  Йаа Жаарал-мустажиириин
  Йаа Малжа ал-ъаасиин
  Йаа Гоофирал-музнибиин
  Йаа Амаанал-хооифиин
  Йаа Раахимал-масаакиин
  Йаа Аниисал-муставхишиин
  Йаа Мужийба даъватил-мудторриин
  `,
    secondText:
      "Субхаанака йаа лаа илааhа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id: 15,
    firstText: "",
    javshantext: `
  Йаа Залжууди вал ихсаан
  Йаа Залфадли вал имтинаан
  Йаа Зал амни вал амаан
  Йаа Залкудси вас-субхаан
  Йаа Залхикмати вал байаан
  Йаа Зар-рохмати вар-ридваан
  Йаа Залхужжати вал бурхаан
  Йаа Зал ъазомати вас-султоон
  Йаа Зал ъафви вал гуфроон
  Йаа Зар-ро'фати вал мустаъаан
`,
    secondText:
      "Субхаанака йаа лаа илааhа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id: 16,
    firstText: "",
    javshantext: `
  Йаа Ман хува Раббу кулли шай
  Йаа Ман хува илааху кулли шай
  Йаа Ман хува Хоолику кулли шай
  Йаа Ман хува фавко кулли шай
  Йаа Ман хува кобла кулли шай
  Йаа Ман хува баъда кулли шай
  Йаа Ман хува ЪАлииму кулли шай
  Йаа Ман хува Коодиру кулли шай
  Йаа Ман хува Сааниъу кулли шай
  Йаа Ман хува йабкоо вайафнаа куллу шай
`,
    secondText:
      "Субхаанака йаа лаа илааhа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id: 17,
    firstText: "Ва ас'алука би асмааика",
    javshantext: `
  Йа Му'мин
  Йаа Мухаймин
  Йаа Мукаввин
  Йаа Мулаккин
  Йаа Мубаййин
  Йаа Мухаввин
  Йаа Музаййин
  Йаа Муъаззим
  Йаа Муъаввин
  Йаа Мулаввин
`,
    secondText:
      "Субхаанака йаа лаа илааhа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id: 18,
    firstText: "",
    javshantext: `
  Йаа ман хува фии мулкихии мукиим
  Йаа ман хува фии жалаалихии азиим
  Йаа ман хува фии султоонихии кодиим
  Йаа ман хува ъалаа ъабдихии рохиим
  Йаа ман хува бикулли шайин ъалиим
  Йаа ман хува лиман жафааху халиим
  Йаа ман хува лиман таражжааху кариим
  Йаа ман хува фии макоодиирихии хакиим
  Йаа ман хува фии хукмихии латииф
  Йаа ман хува фии лутфихии кодиир
`,
    secondText:
      "Субхаанака йаа лаа илааhа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id: 19,
    firstText: "",
    javshantext: `
  Йаа ман лаа йуржаа иллаа фадлуh
  Йаа ман лаа йухоофу иллаа задлуh
  Йаа ман лаа йунтазору иллаа бирруh
  Йаа ман лаа йус'алу иллаа ъафвуh
  Йаа ман лаа йадууму иллаа мулкуh
  Йаа ман лаа султоона иллаа султаануh
  Йаа ман лаа бурhаана иллаа бурhаануh
  Йаа ман васиъат кулла шай'ин рахматуh
  Йаа ман сабакат рахматуhу ъалаа годабиh
  Йаа ман ахаато бикулли шай'ин ъилмуh
`,
    secondText:
      "Субхаанака йаа лаа илааhа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id: 20,
    firstText: "",
    javshantext: `
  Йаа Фаарижал-хамм
  Йаа Каашифал-гомм
  Йаа Гоофираз-занб
  Йаа Кообилат-тауб
  Йаа Хооликол-холк
  Йаа Соодикал-ваъд
  Йаа Роозикот-тыфл
  Йаа Мууфийал-ъахд
  Йаа ЪАалимас-сирр
  Йаа Фааликол-хабб
`,
    secondText:
      "Субхаанака йаа лаа илааhа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id: 21,
    firstText: "",
    javshantext: `
  Йаа ЪАлийй
  Йаа Вафийй
  Йаа Валийй
  Йаа Гонийй
  Йаа Малийй
  Йаа Закийй
  Йаа Родийй
  Йаа Бадийй
  Йаа Хафийй
  Йаа Ковийй
`,
    secondText:
      "Субхаанака йаа лаа илааhа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id: 22,
    firstText: "",
    javshantext: `
  Йаа Ман азхарал-жамиил
  Йаа Ман сатара ъалал-кобиих
  Йаа Ман лаа йуаахызу бил-жариимах
  Йаа Ман лаа йахтикус-ситр
  Йаа ЪАзиимал-ъафв
  Йаа Хасанат-тажаавуз
  Йаа Ваасиъал-магфира
  Йаа Бааситол-йадайни бир-рахма
  Йаа Соохиба кулли нажваа
  Йаа Мунтахаа кулли шаква
`,
    secondText:
      "Субхаанака йаа лаа илааhа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id: 23,
    firstText: "",
    javshantext: `
  Йаа Зан-ниъматис-саабигоh
  Йаа Зар-рохматил ваасиъаh
  Йаа Залхикматил баалигоh
  Йаа Залкудротил каамилаh
  Йаа Залхужжатил коотиъаh
  Йаа Залкарооматиз-Зоохироh
  Йаа Зас-сыфатил ъаалийаh
  Йаа Зал ъиззатид-дааимаh
  Йаа Залкувватил матиинаh
  Йаа Залминнатис-саабикоh
`,
    secondText:
      "Субхаанака йаа лаа илааhа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id: 24,
    firstText: "",
    javshantext: `
  Йаа Ахкамал-хаакимиин
  Йаа Аъдалал-ъаадилиин
  Йаа Асдакос-соодикиин
  Йаа Азхараз-зоохириин
  Йаа Атхарот-тоохириин
  Йаа Ахсанал-хооликиин
  Йаа Асраъал-хаасибиин
  Йаа Асмаъас-саамиъиин
  Йаа Акрамал-акрамиин
  Йаа Архамар-раахимиин
  Йаа Ашфаъаш-шаафиъии
`,
    secondText:
      "Субхаанака йаа лаа илааhа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id: 25,
    firstText: "",
    javshantext: `
  Йаа Бадииъас-самааваат
  Йаа Жааилаз-зулумаат
  Йаа ЪАалимал хофиййаат
  Йаа Роохимал ъабароот
  Йаа Саатирол ъавароот
  Йаа Каашифал балиййаат
  Йаа Мухйийал амваат
  Йаа Дооъифал хасанаат
  Йаа Мунзилал баракаат
  Йаа Шадиидан-накомаат
`,
    secondText:
      "Субхаанака йаа лаа илааhа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id: 26,
    firstText: "Ва асалука биасмааика",
    javshantext: `
  Йаа Мусоввир
  Йаа Мукоддир
  Йаа Мутоххир
  Йаа Мунаввир
  Йаа Мукоддим
  Йаа Муаххыр
  Йаа Муйассир
  Йаа Мунзир
  Йаа Мубашшир
  Йаа Мудаббир
`,
    secondText:
      "Субхаанака йаа лаа илааhа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id: 27,
    firstText: "",
    javshantext: `
  Йаа Роббал байтил хароом
  Йаа Роббаш-шахрил хароом
  Йаа Роббал масжидил хароом
  Йаа Роббал баладил хароом
  Йаа Роббар-рукни вал макоом
  Йаа Роббал машъарил хароом
  Йаа Роббал хилли вал харом
  Йаа Роббан-нуури ваз-золаам
  Йаа Роббат-тахиййати вассалаам
  Йаа Роббал жалаали вал икроом
`,
    secondText:
      "Субхаанака йаа лаа илааhа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id: 28,
    firstText: "",
    javshantext: `
  Йаа Ъимаада ман лаа ъимаада лаh
  Йаа Санада ман лаа санада лаh
  Йаа Зухра ман лаа зухра лаh
  Йаа Гыйааса ман лаа гыйааса лаh
  Йаа Хирза ман лаа хирза лаh
  Йаа Фахра ман лаа фахра лаh
  Йаа Ъизза ман лаа ъизза лаh
  Йаа Муъиина ман лаа муъиина лаh
  Йаа Анииса ман лаа анииса лаh
  Йаа Гунйата ман лаа гунйата лаh
`,
    secondText:
      "Субхаанака йаа лаа илааhа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id: 29,
    firstText: "Ва ас'алука би асмааика",
    javshantext: `
  Йаа Кооим
  Йаа Дааим
  Йаа Роохим
  Йаа Хааким
  Йаа ЪАалим
  Йаа ЪАасым
  Йаа Коосим
  Йаа Саалим
  Йаа Кообид
  Йаа Баасит
`,
    secondText:
      "Субхаанака йаа лаа илааhа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id: 30,
    firstText: "",
    javshantext: `
  Йаа Аасыма-манистаъсамаh
  Йаа Раахима манистархамаh
  Йаа Наасыра манистансараh
  Йаа Хаафизо манистахфазоh
  Йаа Мукрима манистакрамаh
  Йаа Муршида манистаршадаh
  Йаа Муъиина манистаъаанаh
  Йаа Мугииса манистагоосаh
  Йаа Сариихо манистасрохоh
  Йаа Гоофиро манистагфароh
`,
    secondText:
      "Субхаанака йаа лаа илааhа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id: 31,
    firstText: "",
    javshantext: `
  Йаа Кариимас-софхи
  Йаа ЪАзиимал манни
  Йаа Касиирол хойр
  Йаа Кодиимал фадл
  Йаа Латыйфас-сунъи
  Йаа Дааимал-лутф
  Йаа Наафисал карб
  Йаа Каашифад-дурри
  Йаа Мааликал мулк
  Йаа Коодийан билхакк
`,
    secondText:
      "Субхаанака йаа лаа илааhа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id: 32,
    firstText: "",
    javshantext: `
  Йаа ЪАзиизан лаа йудоом
  Йаа Латыйфан лаа йуроом
  Йаа Рокиибан лаа йанаам
  Йаа Кооиман лаа йафуут
  Йаа Хаййан лаа йамуут
  Йаа Маликан лаа йазуул
  Йаа Баакыйан лаа йафнаа
  Йаа ЪАалиман лаа йажхал
  Йаа Сомадан лаа йутъам
  Йаа Ковиййан лаа йудъаф
`,
    secondText:
      "Субхаанака йаа лаа илааhа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id: 33,
    firstText: "Ва ас'алука би асмааика",
    javshantext: `
  Йаа Ваахид
  Йаа Ваажид
  Йаа Шаахид
  Йаа Маажид
  Йаа Роошид
  Йаа Бааъис
  Йаа Ваарис
  Йаа Доорр
  Йаа Наафиъ
  Йаа Хаадии
`,
    secondText:
      "Субхаанака йаа лаа илааhа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id: 34,
    firstText: "",
    javshantext: `
  Йаа Аъзому мин кулли ъазиим
  Йаа Акраму мин кулли кариим
  Йаа Архаму мин кулли рохиим
  Йаа Ахкаму мин кулли хакиим
  Йаа Аъламу мин кулли ъалиим
  Йаа Акдаму мин кулли кодиим
  Йаа Акбару мин кулли кабиир
  Йаа Ажаллу мин кулли жалиил
  Йаа Аъаззу мин кулли ъазииз
  Йаа Алтафу мин кулли латыйф  
`,
    secondText:
      "Субхаанака йаа лаа илааhа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id: 35,
    firstText: "",
    javshantext: `
  Йаа ман хува фии ъахдихии вафийй
  Йаа ман хува фии вафааихии ковийй
  Йаа ман хува фии кувватихии ъалийй
  Йаа ман хува фии ъулуввихии корииб
  Йаа ман хува фии курбихии латыйф
  Йаа ман хува фии лутфихии шарииф
  Йаа ман хува фии шарофихии ъазииз
  Йаа ман хува фии ъиззатихии ъазиим
  Йаа ман хува фии ъазоматихии мажиид
  Йаа ман хува фии маждихии хамиид
`,
    secondText:
      "Субхаанака йаа лаа илааhа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id: 36,
    firstText: "",
    javshantext: `
  Йаа Ман хува куллу шай'ин хоодыъун лаh
  Йаа Ман хува куллу шай'ин каайнун лаh
  Йаа Ман хува куллу шай'ин мавжудуун лаh
  Йаа Ман хува куллу шай'ин муниибун лаh
  Йаа Ман хува куллу шай'ин хооифун минh
  Йаа Ман хува куллу шай'ин мусаббихун лаh
  Йаа Ман хува куллу шай'ин кооимун биh
  Йаа Ман хува куллу шай'ин хоошиун лаh
  Йаа Ман хува куллу шай'ин сааирун илайh
  Йаа Ман хува куллу шай'ин хааликун иллаа важхаh
`,
    secondText:
      "Субхаанака йаа лаа илааhа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id: 37,
    firstText: "Ва ас'алука би асмааика",
    javshantext: `
  Йаа Каафии  
  Йаа Шаафии
  Йаа Ваафии
  Йаа Муъаафии
  Йаа ЪАалии
  Йаа Дааъии
  Йаа Роодии
  Йаа Коодии
  Йаа Баакый
  Йаа Хаадии
`,
    secondText:
      "Субхаанака йаа лаа илааhа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id: 38,
    firstText: "",
    javshantext: `
  Йаа Ман лаа мафарро иллаа илайh
  Йаа Ман лаа мафзаъа иллаа илайh
  Йаа Ман лаа малжа-а иллаа илайh
  Йаа Ман лаа йутаваккалу иллаа ъалайh
  Йаа Ман лаа максода иллаа илайh
  Йаа Ман лаа манжа а иллаа илайh
  Йаа Ман лаа йургобу иллаа илайh
  Йаа Ман лаа йуъбаду иллаа иййааh
  Йаа Ман лаа йустаъаану иллаа минh
  Йаа Ман лаа хавла валаа куввата иллаа биh 
`,
    secondText:
      "Субхаанака йаа лаа илааhа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id: 39,
    firstText: "",
    javshantext: `
  Йаа Хойрол мархуубиин
  Йаа Хойрол матлуубиин
  Йаа Хойрол маргуубиин
  Йаа Хойрол мас'уулиин
  Йаа Хойрол максуудийн
  Йаа Хойрол мазкуурийн
  Йаа Хойрол машкуурийн
  Йаа Хойрол махбуубиин
  Йаа Хойрол мунзилиин
  Йаа Хойрол муста'нисиин
`,
    secondText:
      "Субхаанака йаа лаа илааhа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id: 40,
    firstText: "",
    javshantext: `
  Йаа Ман хува холако фасавваа
  Йаа Ман хува коддаро фахадаа
  Йаа Ман хува йакшифул-балваа
  Йаа Ман хува йасмаъун-нажваа
  Йаа Ман хува йункизул-горкоо
  Йаа Ман хува йунжил-халкаа
  Йаа Ман хува йашфил-мардоо
  Йаа Ман хува амаата ва ахйаа
  Йаа Ман хува адхака ва абкаа
  Йаа Ман хува адолла ва ахдаа
`,
    secondText:
      "Субхаанака йаа лаа илааhа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id: 41,

    firstText: "Ва ас'алука биасмааика",
    javshantext: `
  Йаа Гоофир
  Йаа Саатир
  Йаа Коохир
  Йаа Коодир
  Йаа Наазыр
  Йаа Фаатыр
  Йаа Шаакир
  Йаа Заакир
  Йаа Наасыр
  Йаа Жаабир
`,
    secondText:
      "Субхаанака йаа лаа илааhа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id: 42,
    firstText: "",
    javshantext: `
  Йаа Ман хува фил-барри вал-бахри сабиилуh
  Йаа Ман хува фил-аафааки аайаатуh
  Йаа Ман хува фил-аайаати бурхаануh
  Йаа Ман хува фил-мамаати кудратуh
  Йаа Ман хува фил-кубуури ъиззатуh
  Йаа Ман хува фил-кыйаамати милкатуh
  Йаа Ман хува фил-хисааби хайбатуh
  Йаа Ман хува фил-миизаани кодооуh
  Йаа Ман хува фил-жаннати рахматуh
  Йаа Ман хува фин-наари ъазаабуh 
`,
    secondText:
      "Субхаанака йаа лаа илааhа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id: 43,
    firstText: "",
    javshantext: `
  Йаа Ман хува илайхи йахрабул-хооифуун
  Йаа Ман хува илайхи йафзаъул-музнибуун
  Йаа Ман хува илайхи йаксыдул-муниибуун
  Йаа Ман хува илайхи йалжаул-ъаасуун
  Йаа Ман хува илайхи йаргабуз-заахидуун
  Йаа Ман хува фиихи йатмаул-хоотыуун
  Йаа Ман хува йаста'нису бихил-муриидуун
  Йаа Ман хува йафтахыру бихил-мухсинуун
  Йаа ман хува ъалайхи йатаваккалулмутаваккилуун
  Йаа ман хува йаскуну бихил-муукынуун 
`,
    secondText:
      "Субхаанака йаа лаа илааhа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id: 44,
    firstText: "",
    javshantext: `
  Йаа Акробу мин кулли корииб
  Йаа Ахаббу мин кулли хабииб
  Йаа Аъзому мин кулли ъазиим
  Йаа Аъаззу мин кулли ъазииз
  Йаа Акваа мин кулли ковийй
  Йаа Агнаа мин кулли гонийй
  Йаа Ажваду мин кулли жаваад
  Йаа Ар афу мин кулли роууф
  Йаа Архаму мин кулли рохиим
  Йаа Ажаллу мин кулли жалиил 
`,
    secondText:
      "Субхаанака йаа лаа илааhа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id: 45,
    firstText: "Ва а'салука биасмааика",
    javshantext: `
  Йаа Корииб
  Йаа Рокииб
  Йаа Хабииб
  Йаа Мужииб
  Йаа Хасииб
  Йаа Тобииб
  Йаа Басыйр
  Йаа Хобиир
  Йаа Муниир
  Йаа Мубиин
`,
    secondText:
      "Субхаанака йаа лаа илааhа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id: 46,
    firstText: "",
    javshantext: `
  Йаа Гоолибан гойра маглууб
  Йаа Соониъан гойра маснууъ
  Йаа Хооликон гойра махлуук
  Йаа Мааликан гойра мамлуук
  Йаа Коохиран гойра макхуур
  Йаа Роофиъан гойра марфууъ
  Йаа Хаафизон гойра махфууз
  Йаа Наасыран гойра мансуур
  Йаа Шаахидан гойра гооиб
  Йаа Кориибан гойра баъйид 
`,
    secondText:
      "Субхаанака йаа лаа илааhа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id: 47,
    firstText: "",
    javshantext: `
  Йаа Нууран-нуур
  Йаа Мунаввиран-нуур
  Йаа Мусоввиран-нуур
  Йаа Хооликан-нуур
  Йаа Мукоддиран-нуур
  Йаа Мудаббиран-нуур
  Йаа Нууран кобла кулли нуур
  Йаа Нууран баъда кулли нуур
  Йаа Нууран фавко кулли нуур
  Йаа Нууран лайса мислахуу нуур  
`,
    secondText:
      "Субхаанака йаа лаа илааhа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id: 48,
    firstText: "",
    javshantext: `
  Йаа Ман атооухуу шарифу
  Йаа Ман фиълхуу латыйф
  Йаа Ман лутфухуу мукиим
  Йаа Ман ихсаануху кодиим
  Йаа Ман ковлуху хакк
  Йаа Ман ваъдухуу сыдк
  Йаа Ман ъафвухуу фадл
  Йаа Ман ъазабухуу ъадл
  Йаа Ман зикрухуу хулв
  Йаа Ман унсухуу лазиим
`,
    secondText:
      "Субхаанака йаа лаа илааhа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id: 49,
    firstText: "Ва ас'алука биасмааика",
    javshantext: `
  Йаа Мунаввил
  Йаа Муфассыл
  Йаа Мубаддил
  Йаа Мусаххил
  Йаа Муزиллил
  Йаа Муназзил
  Йаа Мухаввил
  Йаа Музаммил
  Йаа Мукаммил
  Йаа Муфаддил
`,
    secondText:
      "Субхаанака йаа лаа илааhа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id: 50,
    firstText: "",
    javshantext: `
  Йаа Ман йараа валаа йураа
  Йаа Ман йахлуку валаа йухлак
  Йаа Ман йахдии валаа йухдаа
  Йаа Ман йухйии валаа йухйаа
  Йаа Ман йутъиму валаа йутъам
  Йаа Ман йужииру валаа йужаар
  Йаа Ман йакдии валаа йукдоо ъалайh
  Йаа Ман йахкуму валаа йухкаму ъалайh
  Йаа Ман лам йалид ва лам йуулад
  Ва лам йакун лахуу куфуван ахад
`,
    secondText:
      "Субхаанака йаа лаа илааhа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id: 51,
    firstText: "",
    javshantext: `
  Йаа Ниъмал-хабииб
  Йаа Ниъмат-тобииб
  Йаа Ниъмал-хасииб
  Йаа Ниъмал-корииб
  Йаа Ниъмар-рокииб
  Йаа Ниъмал-мужииб
  Йаа Ниъмал-аниис
  Йаа Ниъмал-вакиил
  Йаа Ниъмал-мавлаа
  Йаа Ниъман-насиир
`,
    secondText:
      "Субхаанака йаа лаа илааhа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id: 52,
    firstText: "",
    javshantext: `
  Йаа Суруурал-ъаарифиин
  Йаа Аниисал-муриидиин
  Йаа Мугиисал-муштаакиин
  Йаа Хабиибат-тавваабиин
  Йаа Роозикол-мукыллиин
  Йаа Рожаа ал-музнибиин
  Йаа Каашифал-макруубиин
  Йаа Мунаффисан ъанил-магмуумиин
  Йаа Муфаррижан ъанил-махзууниин
  Йаа Илаахал-аввалиина вал-аахириин
`,
    secondText:
      "Субхаанака йаа лаа илааhа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id: 53,
    firstText: "",
    javshantext: `
  Йаа Раббал-жаннати ван-наар
  Йаа Раббан-набиййиина вал-ахйаар
  Йаа Раббас-сыддийкиина вал-аброор
  Йаа Раббас-сыгаари вал-кибаар
  Йаа Раббал-хубууби вал-асмаар
  Йаа Раббал-анхаари вал-ашжаар
  Йаа Раббас-сахаараа вал-кыфаар
  Йаа Раббал-ъабийди вал-ахроор
  Йаа Раббал-иълаани вал-исраар
  Йаа Раббал-лайли ван-нахаар
`,
    secondText:
      "Субхаанака йаа лаа илааhа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id: 54,
    firstText: "",
    javshantext: `
  Йаа Ман лахико фии кулли шайин ъилмуh
  Йаа Ман нафаза би кулли шайин басаруh
  Йаа Ман балагот илаа кулли шайин кудратуh
  Йаа Ман лаа йухсыл-ъибааду намааэh
  Йаа Ман лаа таблугул-холааику шукраh
  Йаа Ман лаа тудрикул-афхааму жалаалаh
  Йаа Ман лаа танаалул-аухааму кунхаh
  Йаа Манил-ъазомату вал-кибрийаау ридаауh
  Йаа Манил-хайбату вас-султоону бахаауh
  Йаа Ман таъаззаза бил-ъиззи бакооух
`,
    secondText:
      "Субхаанака йаа лаа илааhа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id: 55,
    firstText: "",
    javshantext: `
  Йаа Ман лахул-масалул-аълаа
  Йаа Ман лахус-сыфаатул-ъулаа
  Йаа Ман лахул-аахирату вал-уулаа
  Йаа Ман лахул-жаннатул-ма'ваа
  Йаа Ман лахун-наару вал-лазоо
  Йаа Ман лахул-аайаатул-куброо
  Йаа Ман лахул-асмааул-хуснаа
  Йаа Ман лахул-хукму вал-кодоо
  Йаа Ман лахус-самааваатул-ъулаа
  Йаа Ман лахул-аршу вас-сароо
`,
    secondText:
      "Субхаанака йаа лаа илааhа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id: 56,
    firstText: "Ва асалука биасмааика",
    javshantext: `
  Йаа ЪАфувв
  Йаа Гофуур
  Йаа Вадууд
  Йаа Шакуур
  Йаа Собуур
  Йаа Раууф
  Йаа ЪАтууф
  Йаа Куддуус
  Йаа Хайй
  Йаа Коййуум
`,
    secondText:
      "Субхаанака йаа лаа илааhа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id: 57,
    firstText: "",
    javshantext: `
  Йаа Ман хува фис-самааи ъазоматух
  Йаа Ман хува фил-арди аайаатуh
  Йаа Ман хува фии кулли шайин далааилуh
  Йаа Ман хува фил-бихаари ъажааибуh
  Йаа Ман хува йабдаул-холко сумма йуъиидуh
  Йаа Ман хува фил-жибаали хозаайнух
  Йаа Ман ахсана кулла шайин холакоh
  Йаа Ман илайхи йуржаъул амру куллуh
  Йаа Ман зохаро фии кулли шайин лутфуh
  Йаа Ман йуъаррифул-холааико кудратаh
`,
    secondText:
      "Субхаанака йаа лаа илааhа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id: 58,
    firstText: "",
    javshantext: `
  Йаа Хабииба ман лаа хабииба лаh
  Йаа Тобииба ман лаа тобииба лаh
  Йаа Мужииба ман лаа мужииба лаh
  Йаа Шафиика ман лаа шафиика лаh
  Йаа Рофиика ман лаа рафиика лаh
  Йаа Шафииъа ман лаа шафииъа лаh
  Йаа Мугииса ман лаа мугииса лаh
  Йаа Далиила ман лаа далиила лаh
  Йаа Кооида ман лаа кооида лаh
  Йаа Роохима ман лаа раахима лаh
`,
    secondText:
      "Субхаанака йаа лаа илааhа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id: 59,
    firstText: "",
    javshantext: `
  Йаа Каафийа манистакфааh
  Йаа Хаадийа манистахдааh
  Йаа Каалийа манистаклааh
  Йаа Дааъийа манистадъааh
  Йаа Шаафийа манисташфааh
  Йаа Коодыйа манистакдооh
  Йаа Мугнийа манистагнааh
  Йаа Мууфийа маниставфааh
  Йаа Муковвийа манистаквааh
  Йаа Валиййа маниставлааh
`,
    secondText:
      "Субхаанака йаа лаа илааhа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id: 60,
    firstText: "Ва ас алука биасмааика",
    javshantext: `
  Йаа Аввал
  Йаа Аахыр
  Йаа Зоохир
  Йаа Баатын
  Йаа Хоолик
  Йаа Роозик
  Йаа Соодык
  Йаа Саабик
  Йаа Сааик
  Йаа Фаалик
`,
    secondText:
      "Субхаанака йаа лаа илааhа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id: 61,
    firstText: "",
    javshantext: `
  Йаа Ман йуколлибул-лайла ван-нахаар
  Йаа Ман Холакоз-зулумаати ван-нуур
  Йаа Ман жаъалаз-зылла вал-харуур
  Йаа Ман саххорос-шамса вал-комар
  Йаа Ман холакал-мавта вал-хайаат
  Йаа Ман лахул-холку вал-амр
  Йаа Ман ламйаттахиз соохибатан валаа Валадаа
  Йаа Ман лам йакун лахуу шариикун фил- мулк
  Йаа Ман лам йакун лахуу валиййун миназ- зулл
  Йаа ман лахул-хавлу вал-куввах
`,
    secondText:
      "Субхаанака йаа лаа илааhа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id: 62,
    firstText: "",
    javshantext: `
  Йаа Ман йаъламу мураадал-муриидиин
  Йаа Ман йамлику хавааижас-сааилиин
  Йаа Ман йасмаъу аниинал-валихиин
  Йаа Ман йараа букаа ал-хооифиин
  Йаа Ман йаъламу домиирос-соомитиин
  Йаа Ман йараа надаман-наадимиин
  Йаа Ман йакбалу ъузрат-тааибиин
  Йаа Ман лаа йуслиху ъамалал-муфсидиин
  Йаа Ман лаа йудииъу ажрал-мухсиниин
  Йаа Ман лаа йабуду ан кулуубил-арифийн
`,
    secondText:
      "Субхаанака йаа лаа илааhа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id: 63,
    firstText: "",
    javshantext: `
  Йаа Дааимал-бакоо
  Йаа Гоофирал-хотаа
  Йаа Саамиъад-дуъаа
  Йаа Ваасиъал-ъатоо
  Йаа Раафиъас-самаа
  Йаа Каашифал-балаа
  Йаа ЪАзиимас-санаа
  Йаа Кодиимас-санаа
  Йаа Касиирал-вафаа
  Йаа Шариифал-жазаа
`,
    secondText:
      "Субхаанака йаа лаа илааhа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id: 64,
    firstText: "Ва ас алука биасмааика",
    javshantext: `
  Йаа Гоффаар
  Йаа Саттаар
  Йаа Коххаар
  Йаа Жаббаар
  Йаа Соббаар
  Йаа Роззаак
  Йаа Фаттаах
  Йаа ЪАллаам
  Йаа Ваххааб
  Йаа Таввааб  
`,
    secondText:
      "Субхаанака йаа лаа илааhа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id: 65,
    firstText: "",
    javshantext: `
  Йаа Ман холаконии ва савваании
  Йаа Ман разаконии ва раббаании
  Йаа Ман атъамании ва сакоонии
  Йаа Ман коррабании ва аднаании
  Йаа Ман ъасомании ва кафаании
  Йаа Ман хафизонии ва калаании
  Йаа Ман ваффаконии ва хадаании
  Йаа Ман аъаззании ва агнаании
  Йаа Ман амаатании ва ахйаании
  Йаа Ман аанасании ва ааваании
`,
    secondText:
      "Субхаанака йаа лаа илааhа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id: 66,
    firstText: "",
    javshantext: `
  Йаа Ман йухиккул-хакко бикалимаатих
  Йаа Ман лаа муъаккиба лихукмих
  Йаа Ман лаа роодда ликодооих
  Йаа Ман йахуулу байнал-мар и ва колбих
  Йаа Ман йакбалут-тавбата ъан ъибаадих
  Йаа Ман лаа танфаъуш-шафааъату иллаа би изних
  Йаа Манис-самааваату матвиййаатун бийамииних
  Йаа Ман хува аъламу би ман долла ъан сабиилих
  Йаа Ман йусаббихур-роъду бихамдихи валмалааикату мин хиифатих
  Йаа Ман йурсилур-рийааха бушран байна йадай рахматиh
`,
    secondText:
      "Субхаанака йаа лаа илааhа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id: 67,
    firstText: "",
    javshantext: `
  Йаа Ман жаъалал-ардо михаадаа
  Йаа Ман жаъалал-жибаала автаадаа
  Йаа Ман жаъалаш-шамса сироожаа
  Йаа Ман жаъалал-камаро нуураа
  Йаа Ман жаъалал-лайла либааса
  Йаа Ман жаъалан-нахаара маъаашаа
  Йаа Ман жаъалан-наума субаатаа
  Йаа Ман жаъалас-самааэ бинааэ
  Йаа Ман жаъалал-ашйааэ азваажаа
  Йаа Ман жаъалан-нааро мирсоодаа
`,
    secondText:
      "Субхаанака йаа лаа илааhа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id: 68,
    firstText: "Ва асалука биасмааика",
    javshantext: `
  Йаа Шафииъ
  Йаа Самииъ
  Йаа Рофииъ
  Йаа Манииъ
  Йаа Бадииъ
  Йаа Сарииъ
  Йаа Башиир
  Йаа Назиир
  Йаа Кодиир
  Йаа Муктадир  
`,
    secondText:
      "Субхаанака йаа лаа илааhа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id: 69,
    firstText: "",
    javshantext: `
  Йаа Хаййу кобла кулли хайй
  Йаа Хаййу баъда кулли хайй
  Йаа Хаййуллазии лаа йушбихухуу шай
  Йаа Хаййуллазии лайса камислихии хайй
  Йаа Хаййуллазии лаа йушаарикухуу хайй
  Йаа Хаййуллазии лаа йахтаажу илаа хайй
  Йаа Хаййуллазии йумииту кулла хайй
  Йаа Хаййуллазии йарзуку кулла хайй
  Йаа Хаййуллазии йухйил-маутаа
  Йаа Хаййуллазии лаа йамуут
`,
    secondText:
      "Субхаанака йаа лаа илааhа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id: 70,
    firstText: "",
    javshantext: `
  Йаа Ман лахуу зикрун лаа йунсаа
  Йаа Ман лахуу нурун лаа йутфаа
  Йаа Ман лахуу санааун лаа йухсоо
  Йаа Ман лахуу нуъуутун лаа тугоййар
  Йаа Ман лахуу ниъамун лаа туъадд
  Йаа Ман лахуу мулкун лаа йазуул
  Йаа Ман лахуу жалаалун лаа йукаййаф
  Йаа Ман лахуу кодооун лаа йуродд
  Йаа Ман лахуу сыфаатун лаа тубаддал
  Йаа Ман лахуу камаалун лаа йудрак  
`,
    secondText:
      "Субхаанака йаа лаа илааhа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id: 71,
    firstText: "",
    javshantext: `
  Йаа Раббал-ъааламиин
  Йаа Маалика йаумид-диин
  Йаа Ман йухиббус-сообириин
  Йаа Ман йухиббут-тавваабиин
  Йаа Ман йухиббул-мутатоххириин
  Йаа Ман йухиббул-мухсиниин
  Йаа Ман хува хойрун-наасириин
  Йаа Ман хува хойрул-фасылиин
  Йаа Ман хува хойруш-шаакириин
  Йаа ман хува аъламу бил-муфсидиин
`,
    secondText:
      "Субхаанака йаа лаа илааhа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id: 72,
    firstText: "Ва ас алука биасмааика",
    javshantext: `
  Йаа Мубди
  Йаа Муъиид
  Йаа Хафииз
  Йаа Мухиит
  Йаа Хамиид
  Йаа Мажиид
  Йаа Мукиит
  Йаа Мугиис
  Йаа Муъизз
  Йаа Музилл
`,
    secondText:
      "Субхаанака йаа лаа илааhа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id: 73,
    firstText: "",
    javshantext: `
  Йаа Ман хува Ахадун билаа дзыдд
  Йаа Ман хува Фардун билаа нидд
  Йаа Ман хува Сомадун билаа ъайб
  Йаа Ман хува Витрун билаа Шафъ
  Йаа Ман хува Раббун билаа вазиир
  Йаа Ман хува Гониййун билаа факр
  Йаа Ман хува Султаанун билаа ъазл
  Йаа Ман хува Мааликун билаа ъажз
  Йаа Ман хува Мавжуудун билаа мисл
`,
    secondText:
      "Субхаанака йаа лаа илааhа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id: 74,
    firstText: "",
    javshantext: `
  Йаа Ман хува зикрухуу шарафун лиз- заакириин
  Йаа Ман хува шукрухуу фаузун лиш- шаакириин
  Йаа Ман хува хамдухуу фахрун лил- хаамидиин
  Йаа Ман хува тооъатухуу нажаатун лил мутииъиин
  Йаа Ман хува баабуху мафтуухун лит- тоолибиин
  Йаа Ман хува сабиилухуу ваадыхун лил- му'миниин
  Йаа ман хува аайаатухуу бурхаанун лин-наазыриин
  Йаа ман хува китаабухуу тазкиратун лилмуукыниин
  Йаа ман хува ъафвуху малжаун лил-музнибиин
  Йаа ман хува рахматухуу кориибуун лил-мухсиниин
`,
    secondText:
      "Субхаанака йаа лаа илааhа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id: 75,
    firstText: "",
    javshantext: `
  Йаа Ман табааракасмуh
  Йаа Ман таъаалаа жаддуh
  Йаа Ман жалла санаауh
  Йаа Ман лаа илааха гойруh
  Йаа Ман такоддасат асмааyh
  Йаа Ман йадууму бакооуh
  Йаа Манил-ъазомату бахаауyh
  Йаа Манил-кибрийаау ридаауh
  Йаа Ман лаа йухсаа аалааyh
  Йаа Ман лаа йуъадду наъмаауh
`,
    secondText:
      "Субхаанака йаа лаа илааhа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id: 76,
    firstText: "Ва ас алука биасмааика",
    javshantext: `
  Йаа Муъиин
  Йаа Мубиин
  Йаа Амиин
  Йаа Макиин
  Йаа Матиин
  Йаа Шадиид
  Йаа Шахиид
  Йаа Рошиид
  Йаа Хамиид
  Йаа Мажиид
`,
    secondText:
      "Субхаанака йаа лаа илааhа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id: 77,
    firstText: "",
    javshantext: `
  Йаа Зал-ъаршил-мажиид
  Йаа Зал-коулис-садиид
  Йаа Зал-фадлир-рошиид
  Йаа Зал-батшиш-шадиид
  Йаа Зал-ваъди вал-ваъиид
  Йаа Кариибан гойра баъиид
  Йаа Ман хувал-валиййул-хамиид
  Йаа Ман хува ъалаа кулли шайин шахиид
  Йаа Ман хува лайса бизоллаамин лил- забиид
  Йаа ман хува акробу илайхи мин хаблил- вариид
`,
    secondText:
      "Субхаанака йаа лаа илааhа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id: 78,
    firstText: "",
    javshantext: `
  Йаа Ман лаа шарийка лахуу ва лаа вазиир
  Йаа Ман лаа шабииха лахуу ва лаа назиир
  Йаа Хааликаш-шамси вал-комарил-муниир Мугнийал-бааисил-факиир
  Йаа Роозикат-тыфлис-согиир
  Йаа Роозикат-тыфлис-согиир
  Йаа Раахимаш-шайхил-кабиир
  Йаа Исматал-хооифил-мустажиир
  Йаа Ман хува би ъибаадихии басиир
  Йаа Ман хува бихаваайижил-ъибаади хобиир
  Йаа Ман хува ъалаа кулли шайин кодиир
`,
    secondText:
      "Субхаанака йаа лаа илааhа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id: 79,
    firstText: "",
    javshantext: `
  Йаа Зал-жууди ван-ниъам
  Йаа Зал-фадли вал-каром
  Йаа Зал-баси ван-ником
  Йаа Хооликол-лаухи вал-колам
  Йаа Баариаз-зарри ван-насам
  Йаа Мулхимал-ъараби вал-ъажам
  Йаа Каашифад-дурри вал-алам
  Йаа ЪАалимас-сирри вал-химам
  Йаа Ман лахул-байту вал-харом
  Йаа Ман йахлукул-ашйааэ минал-ъадам
`,
    secondText:
      "Субхаанака йаа лаа илааhа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id: 80,
    firstText: "Ва ас алука биасмааика",
    javshantext: `
  Йаа Аадил
  Йаа Кообил
  Йаа Фаадыл
  Йаа Фааъил
  Йаа Каафил
  Йаа Жааъил
  Йаа Каамил
  Йаа Фаатыр
  Йаа Тоолиб
  Йаа Матлууб
`,
    secondText:
      "Субхаанака йаа лаа илааhа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id: 81,
    firstText: "",
    javshantext: `
  Йаа Ман анъама бихавлиh
  Йаа Ман акрома битовлиh
  Йаа Ман ъаада билутфиh
  Йаа Ман таъаззаза бикудратих
  Йаа Ман коддаро бихикматиh
  Йаа Ман хакама битадбиириh
  Йаа Ман даббаро биъилмиh
  Йаа Ман тажааваза бихилмиh
  Йаа Ман данаа фии ъулуввиh
  Йаа Ман ъалаа фии дунуввиh
`,
    secondText:
      "Субхаанака йаа лаа илааhа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id: 82,
    firstText: "",
    javshantext: `
  Йаа Ман йахлуку маа йашаа
  Йаа Ман йафъалу маа йашаа
  Йаа Ман йахдии ман йашаа
  Йаа Ман йудиллу ман йашаа
  Йаа Ман йагфиру лиман йашаа
  Йаа Ман йуъаззибу ман йашаа
  Йа Ман йатуубу ъалаа ман йашаа
  Йаа Ман йусоввиру фил-архаами кайфа йашаа
  Йаа Ман йазииду фил-холки маа йашаа
  Йаа Ман йахтассу би рахматихии ман йашаа  
`,
    secondText:
      "Субхаанака йаа лаа илааhа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id: 83,
    firstText: "",
    javshantext: `
  Йаа Ман лам йаттахыз соохибатан валаа валадаа
  Йаа Ман лаа йушрику фии хукмихии ахадаа
  Йаа Ман жаъала ли кулли шайин кадроо
  Йаа Ман лам йазал рохиимаа
  Йаа Жааъилал-малааикати русулаа
  Йаа Ман жаъала фис-самааи буруужаа
  Йаа Ман жаъалал-арда кораара
  Йаа Ман жаъала минал-мааи башароо
  Йаа Ман ахсоо кулла шайин ъададаа
  Йаа Ман ахаато би кулли шайин ъилмаа
`,
    secondText:
      "Субхаанака йаа лаа илааhа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id: 84,
    firstText: "Ва ас алука биасмааика",
    javshantext: `
  Йаа Фард
  Йаа Витр
  Йаа Ахад
  Йаа Сомад
  Йаа Амжад
  Йаа Аъазз
  Йаа Ажалл
  Йаа Ахакк
  Йаа Абарр
  Йаа Абад
`,
    secondText:
      "Субхаанака йаа лаа илааhа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id: 85,
    firstText: "",
    javshantext: `
  Йаа Маърууфа ман ъарафаh
  Йаа Маъбууда ман ъабадаh
  Йаа Машкуура ман шакараh
  Йаа Мазкуура ман закараh
  Йаа Махмууда ман хамидаh
  Йаа Мавжууда ман толабаh
  Йаа Мавсууфа ман ваххадаh
  Йаа Махбууба ман ахаббаh
  Йаа Маргууба ман ароодаh
  Йаа Максууда ман анааба илайh
  `,
    secondText:
      "Субхаанака йаа лаа илааhа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id: 86,
    firstText: "",
    javshantext: `
  Йаа Ман лаа мулка иллаа мулкуh
  Йаа Ман лаа йухсил-ъибааду санааеh
  Йаа Ман лаа тасыфул-холааику жалаалаh
  Йаа Ман лаа йудрикул-абсоору камаалаh
  Йаа Ман лаа йаблугул-афхааму сыфаатиh
  Йаа Ман лаа йанаалул-афкаару кибрийааh
  Йаа Ман лаа йухсинул-инсаану нуъуутаh
  Йаа Ман лаа йаруддул-ъибааду кодооаh
  Йаа Ман зохара фии кулли шайин аайаатуh
`,
    secondText:
      "Субхаанака йаа лаа илааhа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id: 87,
    firstText: "",
    javshantext: `
  Йаа Хабиибал-бэккаайин
  Йаа Санадал-мутаваккилиин
  Йаа Хаадийал-мудыллийн
  Йаа Валиййал-му'миниин
  Йаа Аниисаз-заакириин
  Йаа Акдарал-коодирийн
  Йаа Абсорон-наазыриин
  Йаа Аъламал-ъаалимиин
  Йаа Мафзаъал-малхууфиин
  Йаа Ансоран-наасыриин
`,
    secondText:
      "Субхаанака йаа лаа илааhа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id: 88,
    firstText: "",
    javshantext: `
  Йаа Мукрим
  Йаа Муъаззим
  Йаа Мунаъъим
  Йаа Муътии
  Йаа Мугнии
  Йаа Мухйии
  Йаа Мубдии
  Йаа Мурдии
  Йаа Мунжии
  Йаа Мухсин
`,
    secondText:
      "Субхаанака йаа лаа илааhа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id: 89,
    firstText: "",
    javshantext: `
  Йаа Каафийа кулли шай
  Йаа Кооиман ъалаа кулли шай
  Йаа Ман лаа йушбихухуу шай
  Йаа Ман лаа йазииду фии мулкихии шай
  Йаа Ман лаа йанкусу мин хозаайнихии шай
  Йаа Ман лаа йахфаа ъалейхи шай
  Йаа Ман лайса камислихии шай
  Йаа Ман бийадихии макоолииду кулли шай
  Йаа Ман васиъат рохматуху кулла шай
  Йаа Ман йабкоо ва йафнаа куллу шай
`,
    secondText:
      "Субхаанака йаа лаа илааhа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id: 90,
    firstText: "",
    javshantext: `
  Йаа Ман лаа йаъламул-гойба иллаа хуу
  Йаа Ман лаа йасрифус-сууэ иллаа хуу
  Йаа Ман лаа йудаббирул-амро иллаа хуу
  Йаа Ман лаа йагфируз-зунууба иллаа хуу
  Йаа Ман лаа йуколлибул-кулууба иллаа хуу
  Йаа Ман лаа йахлукул-холко иллаа хуу
  Йаа Ман лаа йутиммун-ниъмата иллаа хуу
  Йаа Ман лаа йуназзилул-гойса иллаа хуу
  Йаа Ман лаа йухйил-мавтаа иллаа хуу
  Йаа Ман лаа йугни ъалат-тахкийки иллаа хуу
`,
    secondText:
      "Субхаанака йаа лаа илааhа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id: 91,
    firstText: "Ва ас алука биасмааика",
    javshantext: `
  Йаа Каашиф
  Йаа Фаариж
  Йаа Фаатих
  Йаа Наасир
  Йаа Доомин
  Йаа Аамир
  Йаа Наахии
  Йаа Рожаа
  Йаа Муртажаа
  Йаа ЪАзиимар-рожаа
`,
    secondText:
      "Субхаанака йаа лаа илааhа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id: 92,
    firstText: "",
    javshantext: `
  Йаа Муъиинад-дуъафаа
  Йаа Канзал-фукараа
  Йаа Соохибал-гуробаа
  Йаа Наасырал-авлийаа
  Йаа Коохирал-аъдаа
  Йаа Раафиъас-самаа
  Йаа Каашифал-балаа
  Йаа Аниисал-авлийаа
  Йаа Хабиибал-аткыйаа
  Йаа Илаахал-агнийаа
`,
    secondText:
      "Субхаанака йаа лаа илааhа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id: 93,
    firstText: "",
    javshantext: `
  Йаа Аввала кулли шайин ва аахыроh
  Йаа илааха кулли шайин ва соониъаh
  Йаа Роозико кулли шайин ва хооликоh
  Йаа Фаатыро кулли шайин ва малииках
  Йаа Кообидо кулли шайин ва бааситоh
  Йаа Мубдиа кулли шайин ва муъиидаh
  Йаа Мусаббиба кулли шайин ва мукоддироh
  Йаа Муроббийа кулли шайин ва мудаббираh
  Йаа Мукаввира кулли шайин ва мухаввилаh
  Йаа Мухйийа кулли шайин ва мумиитаh
`,
    secondText:
      "Субхаанака йаа лаа илааhа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id: 94,
    firstText: "",
    javshantext: `
  Йаа Хойра заакириин ва мазкуур
  Йаа Хойра шаакириин ва машкуур
  Йаа Хойра хаамидин ва махмууд
  Йаа Хойра шаахидин ва машхууд
  Йаа Хойра дааъин ва мадъувв
  Йаа Хойра мужиибин ва мужааб
  Йаа Хойра муунисин ва аниис
  Йаа Хойра соохибин ва жалиис
  Йаа Хойра максуудин ва матлууб
  Йаа Хойра хабиибин ва махбууб
`,
    secondText:
      "Субхаанака йаа лаа илааhа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id: 95,
    firstText: "",
    javshantext: `
  Йаа Ман хува лиман даъааху мужииб
  Йаа Ман хува лиман атооъахуу хабииб
  Йаа Ман хува лиман ахаббахуу корииб
  Йаа Ман хува биман ароодахуу ъалиим
  Йаа Ман хува лиман рожааху кариим
  Йаа Ман хува биман ъасооху халиим
  Йаа Ман хува фии хилмихии хакиим
  Йаа Ман хува фии хукмихии ъазиим
  Йаа Ман хува фии ъазоматихии рохиим
  Йаа Ман хува фии ихсаанихии кодиим
`,
    secondText:
      "Субхаанака йаа лаа илааhа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id: 96,
    firstText: "Ва ас алука биасмааика",
    javshantext: `
  Йаа Мусаббиб
  Йаа Мукорриб
  Йаа Муъаккиб
  Йаа Муколлиб
  Йаа Мукоддир
  Йаа Мураттиб
  Йаа Мураггиб
  Йаа Музаккир
  Йаа Мукаввин
  Йаа Мутакаббир
`,
    secondText:
      "Субхаанака йаа лаа илааhа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id: 97,
    firstText: "",
    javshantext: `
  Йаа Ман лаа йушгилухуу самъун ъан самъ
  Йаа Ман лаа йамнаъухуу фиълун ъан фиъл
  Йаа Ман лаа йулхиихи кавлун ъан кавл
  Йаа Ман лаа йуголлитухуу суаалун ъан суаал
  Йаа Ман лаа йубримухуу илхаахул-мулиххиин
  Йаа Ман шараха бил-ислаами судуурол-Му'миниин
  Йаа Ман атооба би зикрихии кулуубал-мухбитиин
  Йаа Ман ла йагиибу ъан кулуубил-Муштаакиин
  Йаа Ман хува гоойату муроодил-муриидиин
  Йаа Ман лаа йахфаа ъалейхи шайун фил ъааламиин
`,
    secondText:
      "Субхаанака йаа лаа илааhа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id: 98,
    firstText: "",
    javshantext: `
  Йаа Ман хува ъилмухуу саабик
  Йаа Ман хува ваъдухуу соодик
  Йаа Ман хува лутфухуу зоохир
  Йаа Ман хува амрухуу гоолиб
  Йаа Ман хува китаабухуу мухкам
  Йаа Ман хува кодооухуу кээин
  Йаа Ман хува кураанухуу мажиид
  Йаа Ман хува мулкухуу кодиим
  Йаа Ман хува фадлухуу мукиим
  Йаа Ман хува аршухуу ъазиим
`,
    secondText:
      "Субхаанака йаа лаа илааhа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id: 99,
    firstText: "",
    javshantext: `
  Йаа Роббал-арбааб
  Йаа Муфаттихал-абвааб
  Йаа Мусаббибал-асбааб
  Йаа Муътыйас савааб
  Йаа Мулхимас-совааб
  Йаа Муншиас-сахааб
  Йаа Шадиидал-ъикааб
  Йаа Сариал-хисааб
  Йаа Ман лахул-ийааб
  Йаа Гофууру йаа Таввааб
`,
    secondText:
      "Субхаанака йаа лаа илааhа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id: 100,
    firstText: "Ва ас алука биасмааика",
    javshantext: `
  Йаа Роббана
  Йаа Илааханаа
  Йаа Саййиданаа
  Йаа Мавлаанаа
  Йаа Наасыронаа
  Йаа Хаафизана
  Йаа Коодиронаа
  Йаа Роозиконаа
  Йаа Далииланаа
  Йаа Мугиисанаа
`,
    secondText:
      "Субхаанака йаа лаа илааhа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
];
