
const JavDua = [
  {
    id:1,
    firstText:"Аллахумма иннии ас'алука би асмааика",
    javshantext:`
Йаа Аллах
Йаа Рахмаан
Йаа Рахиим
Йаа ЪАлиим
Йаа Халиим
Йаа ЪАзиим
Йаа Хакиим
Йаа Кодиим
Йаа Мукиим
Йаа Кариим`,
    secondText:
      "Субхаанака йаа лаа илааа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id:2,
    firstText:"",
    javshantext:`
Иаа Саййидас-саадаат
Йаа Мужиибад-даъваат
Иаа Валиййал-хасанаат
Иаа Рафиъад-даражаат
Йаа ЪАзиимал-баракаат
Йаа Гоофирал-хатииаат
Иаа Даафиъал-балиййаат
Йаа Саамиъал-асваат
Йаа Муътыйал-масуулаат
Йаа ЪАалимас-сирри вал-хофиййаат
  `,
    secondText:
      "Субхаанака йаа лаа илааа иллаа антал амаанал амаана холлиснаа минан-наар",
  },

  {
    id:3,
    firstText:"Аллахумма иннии ас'алука би асмааика",
    javshantext:`
Иаа Хойрол Гоофириин
Йаа Хойрон-Наасыриин
Йаа Хойрол Фаатихиин
Иаа Хойрол Хаакимиин
Йаа Хойрол Ваарисиин
Йаа Хойроз-Заакириин
Иаа Хойрор-Роозикиин
Иаа Хойрол Хаамидиин
Йаа Хойрол Мухсиниин
Иаа Хойрол Фаасылиин
  `,
    secondText:
      "Субхаанака йаа лаа илааа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id:4,
    firstText:"",
    javshantext:`
Йаа Ман лахул-ъиззу вал-жамаал
Йаа Ман лахул-мулку вал-жалаал
Иаа Ман лахул-кудрату вал-камаал
Йаа Ман хувал-кабиирул-мутаъаал
Йаа Ман хува шадиидул-михаал
Йаа Ман хува шадиидул-ъикооб
Иаа Ман хува сарииъул-хисааб
Иаа Ман хува ъиндаху хуснус-савааб
Йаа Ман хува ъиндаху уммул-китааб
Йаа Ман хува йуншиус-сахаабас-сикаал
  `,
    secondText:
      "Субхаанака йаа лаа илааа иллаа антал амаанал амаана холлиснаа минан-наар",
  },{
    id:5,
    firstText:"Ва ас'алука би асмааика",
    javshantext:`
Йаа Ханнаан
Йаа Маннаан
Йаа Даййаан
Йаа Гуфроон
Йаа Бурхаан
Йаа Султоон
Йаа Субхаан
Йаа Мустаъаан
Йаа Зал-Манни вал байаан
Йаа Зал-амаан
  `,
    secondText:
      "Субхаанака йаа лаа илааа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id:6,
    firstText:"",
    javshantext:`
Йаа Ман таваадоъа куллу шайин лиъазаматиh
Иаа Манистаслама куллу шайин ликудратиh
Йаа Ман залла куллу шайин лиъиззатиh
Йаа Ман ходоъа куллу шайин лихайбатиh
Йаа Манинкоода куллу шайин лимулкатиh
Йаа Ман даана куллу шайин мин махоофатиh
Йаа Маниншаккатил-жибаалу мин хошиатиh
Йаа Ман кооматис-самааваату би амриh
Йаа Манистакорротил-арду би изниh
Йаа Ман лаа йаьтадии ъала ахли мамлакатиh
  `,
    secondText:
      "Субхаанака йаа лаа илааа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id:7,
    firstText:"",
    javshantext:`
Йаа Гоофирал хотоойа
Йаа Каашифал балаайа
Йаа Мунтахар-рожаайа
Йаа Мужзилал атоойа
Йаа Ваасиал хадаайа
Йаа Роозикол бараайа
Йаа Коодийал манаайа
Йаа Саамиъаш-шакаайа
Йаа Бааъисас-сароойа
Йаа Мутликол усааро
  `,
    secondText:
      "Субхаанака йаа лаа илааа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id:8,
    firstText:"",
    javshantext:`
Йаа Зал-хамди вас-санаа
Йаа Зал-мажди вас-санаа
Йаа Зал-фахри вал-бахаа
Йаа Зал-ъахди вал-вафаа
Йаа Зал-афви вар-ридоо
Йаа Зал-манни вал-атоо
Йаа Зал-фасли вал-кадоо
Йаа Зал-иззати вал-бакоо
Йаа Зал-жууди ван-намаа
Йаа Зал-фадли вал-аалаа
  `,
    secondText:
      "Субхаанака йаа лаа илааа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id:9,
    firstText:"Ва ас'алука би асмааика",
    javshantext:`
Йаа Зал-хамди вас-санаа
Йаа Зал-мажди вас-санаа
Йаа Зал-фахри вал-бахаа
Йаа Зал-ъахди вал-вафаа
Йаа Зал-афви вар-ридоо
Йаа Зал-манни вал-атоо
Йаа Зал-фасли вал-кадоо
Йаа Зал-иззати вал-бакоо
Йаа Зал-жууди ван-намаа
Йаа Зал-фадли вал-аалаа
  `,
    secondText:
      "Субхаанака йаа лаа илааа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id:10,
    firstText:"",
    javshantext:`
Йаа Соониъа кулли маснууь
Йаа Хоолико кулли махлуук
Йаа Роозико кулли марзуук
Йаа Маалика кулли мамлуук
Йаа Каашифа кулли макрууб
Йаа Фаарижа кулли магмуум
Йаа Раахима кулли мархуум
Йаа Наасыро кулли махзуул
Йаа Саатиро кулли маъйууб
Йаа Малжа-а кулли мазлуум
  `,
    secondText:
      "Субхаанака йаа лаа илааа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id:11,
    firstText:"",
    javshantext:`
Йаа ЪУддатии инда шиддатии
Йаа Рожааии инда мусыйбатии
Йаа Муунисии инда вахшатий
Йаа Соохибии инда гурбатии
Йаа Валиййии инда ниматии
Йаа Каашифии инда курбатии
Йаа Гыйаасии индаф-тикоории
Йаа Малжа-ии ъиндад-тыроории
Йаа Муъиинии инда фазаьии
Йаа Далиилии инда хайротии
  `,
    secondText:
      "Субхаанака йаа лаа илааа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id:12,
    firstText:"",
    javshantext:`
Йаа Аллаамал-гуйууб    
Йаа Гоффаараз-зунууб
Йаа Саттаарол-ъуйууб
Йаа Кашшаафал-курууб
Йаа Мукаллибал-кулууб
Йаа Музаййинал-кулууб
Йаа Мунаввирал-кулууб
Йаа Тобиибал-кулууб
Йаа Хабиибал-кулууб
Йаа Аниисал-кулууб
  `,
    secondText:
      "Субхаанака йаа лаа илааа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id:13,
    firstText:"Ва ас'алука би асмааика",
    javshantext:`
Йаа Жалиил
Йаа Жамиил
Йаа Вакиил
Йаа Кафиил
Йаа Далиил
Иаа Мукиил
Йаа Хобиир
Йаа Латииф
Йаа ЪАзииз
Йаа Малиик
  `,
    secondText:
      "Субхаанака йаа лаа илааа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id:14,
    firstText:"",
    javshantext:`
Йаа Далиилал-мутахаййириин
Йаа Гыйаасал-мустагиисиин
Йаа Сориихол-мустасрихиин
Йаа Жаарал-мустажиириин
Йаа Малжа ал-аасиин
Йаа Гоофирал-музнибиин
Йаа Амаанал-хооифиин
Йаа Раахимал-масаакиин
Йаа Аниисал-муставхишиин
Йаа Мужииба даватил-мудторриин
  `,
    secondText:
      "Субхаанака йаа лаа илааа иллаа антал амаанал амаана холлиснаа минан-наар",
  },
  {
    id:15,
  firstText:"",
  javshantext:`
Йаа Залжууди вал ихсаан
Йаа Залфадли вал имтинаан
Йаа Зал амни вал амаан
Йаа Залкудси вас-субхаан
Йаа Залхикмати вал байаан
Йаа Зар-рохмати вар-ридваан
Йаа Залхужжати вал бурхаан
Йаа Зал азомати вас-султоон
Йаа Зал ъафви вал гуфроон
Йаа Зар-рофати вал мустаьаан
`,
  secondText:
    "Субхаанака йаа лаа илааа иллаа антал амаанал амаана холлиснаа минан-наар",
},
{
  id:16,
  firstText:"",
  javshantext:`
Йаа Ман хува Раббу кулли шай
Йаа Ман хува илааху кулли шай
Йаа Ман хува Хоолику кулли шай
Йаа Ман хува фавко кулли шай
Йаа Ман хува кобла кулли шай
Йаа Ман хува баъда кулли шай
Йаа Ман хува Алииму кулли шай
Йаа Ман хува Коодиру кулли шай
Йаа Ман хува Сааниу кулли шай
Йаа Ман хува йабкоо вайафнаа куллу шай
`,
  secondText:
    "Субхаанака йаа лаа илааа иллаа антал амаанал амаана холлиснаа минан-наар",
},
{
  id:17,
  firstText:"Ва ас'алука би асмааика",
  javshantext:`
Йа Му'мин
Йаа Мухаймин
Йаа Мукаввин
Йаа Мулаккин
Йаа Мубаййин
Йаа Мухаввин
Йаа Музаййин
Йаа Муьаззим
Йаа Муъаввин
Йаа Мулаввин
`,
  secondText:
    "Субхаанака йаа лаа илааа иллаа антал амаанал амаана холлиснаа минан-наар",
},
{
  id:18,
  firstText:"",
  javshantext:`
Йаа ман хува фии мулкихии мукиим
Йаа ман хува фии жалаалихий азиим
Иаа ман хува фии султоонихии кодиим
Йаа ман хува алаа абдихии рохиим
Йаа ман хува бикулли шайин алиим
Йаа ман хува лиман жафааху халиим
Йаа ман хува лиман таражжааху кариим
Йаа ман хува фии макоодиирихии хакиим
Йаа ман хува фии хукмихии латииф
Йаа ман хува фии лутфихии кодиир
`,
  secondText:
    "Субхаанака йаа лаа илааа иллаа антал амаанал амаана холлиснаа минан-наар",
},
{
  id:19,
  firstText:"",
  javshantext:`
Йаа ман лаа йуржаа иллаа фадлу
Йаа ман лаа йухоофу иллаа адлу
Йаа ман лаа йунтазору иллаа бирру
Йаа ман лаа йус'алу иллаа афву
Йаа ман лаа йадууму иллаа мулку
Йаа ман лаа султоона иллаа султаану
Йаа ман лаа бураана иллаа бураану
Йаа ман васиат кулла шай'ин рахмату
Йаа ман сабакат рахматуу валаа годаби
Йаа ман ахаато бикулли шай'ин илму
`,
  secondText:
    "Субхаанака йаа лаа илааа иллаа антал амаанал амаана холлиснаа минан-наар",
},
{
  id:20,
  firstText:"",
  javshantext:`
Йаа Фаарижал-хамм
Йаа Каашифал-гомм
Йаа Гоофираз-занб
Йаа Кообилат-тауб
Йаа Хооликол-холк
Йаа Соодикал-ваъд
Йаа Роозикот-тыфл
Йаа Мууфийал-ъахд
Йаа ЪАалимас-сирр
Йаа Фааликол-хабб
`,
  secondText:
    "Субхаанака йаа лаа илааа иллаа антал амаанал амаана холлиснаа минан-наар",
},
{
  id:21,
  firstText:"",
  javshantext:`
Йаа ЪАлийй
Йаа Вафийй
Йаа Валийй
Йаа Гонийй
Йаа Малийй
Йаа Закийй
Йаа Родийй
Йаа Бадийй
Йаа Хафийй
Йаа Ковийй
`,
  secondText:
    "Субхаанака йаа лаа илааа иллаа антал амаанал амаана холлиснаа минан-наар",
},
{
  id:22,
  firstText:"",
  javshantext:`
Йаа Ман азхарал-жамиил
Йаа Ман сатара алал-кобиих
Иаа Ман лаа йуаахызу бил-жариимах
Йаа Ман лаа иахтикус-ситр
Йаа ЪАзиимал-ъафв
Йаа Хасанат-тажаавуз
Иаа Ваасиал-магфира
Иаа Бааситол-йадайни бир-рахма
Йаа Соохиба кулли нажваа
Йаа Мунтахаа кулли шаква
`,
  secondText:
    "Субхаанака йаа лаа илааа иллаа антал амаанал амаана холлиснаа минан-наар",
},
{
  id:23,
  firstText:"",
  javshantext:`
Йаа Зан-ниъматис-саабиго
Йаа Зар-рохматил ваасиа
Йаа Залхикматил баалиго
Йаа Залкудротил каамила
Йаа Залхужжатил коотиъа
Йаа Залкарооматиз-Зоохиро
Йаа Зас-сыфатил аалийа
Йаа Зал иззатид-дааима
Йаа Залкувватил матиина
Йаа Залминнатис-саабико
`,
  secondText:
    "Субхаанака йаа лаа илааа иллаа антал амаанал амаана холлиснаа минан-наар",
},
{
  id:24,
  firstText:"",
  javshantext:`
Йаа Ахкамал-хаакимиин
Йаа Аъдалал-ъаадилиин
Йаа Асдакос-соодикиин
Йаа Азхараз-зоохириин
Йаа Атхарот-тоохириин
Йаа Ахсанал-хооликиин
Йаа Асраъал-хаасибиин
Йаа Асмаъас-саамиъиин
Йаа Акрамал-акрамиин
Йаа Архамар-раахимиин
Йаа Ашфаьаш-шаафиьии
`,
  secondText:
    "Субхаанака йаа лаа илааа иллаа антал амаанал амаана холлиснаа минан-наар",
},
{
  id:25,
  firstText:"",
  javshantext:`
Йаа Бадииъас-самааваат
Йаа Жааъилаз-зулумаат
Йаа ЪАалимал хофиййаат
Йаа Роохимал абароот
Йаа Саатирол бавароот
Йаа Каашифал балиййаат
Йаа Мухйийал амваат
Йаа Дооъифал хасанаат
Йаа Мунзилал баракаат
Йаа Шадиидан-накомаат
`,
  secondText:
    "Субхаанака йаа лаа илааа иллаа антал амаанал амаана холлиснаа минан-наар",
},
{
  id:26,
  firstText:"Ва асалука биасмааика",
  javshantext:` 
Йаа Мусоввир
Йаа Мукоддир
Йаа Мутоххир
Йаа Мунаввир
Йаа Мукоддим
Йаа Муаххыр
Йаа Муйассир
Йаа Мунзир
Йаа Мубашшир
Йаа Мудаббир
`,
  secondText:
    "Субхаанака йаа лаа илааа иллаа антал амаанал амаана холлиснаа минан-наар",
},
{
  id:27,
  firstText:"",
  javshantext:`
Йаа Роббал байтил хароом
Йаа Роббаш-шахрил хароом
Йаа Роббал масжидил хароом
Йаа Роббал баладил хароом
Йаа Роббар-рукни вал макоом
Йаа Роббал машарил хароом
Йаа Роббал хилли вал харом
Йаа Роббан-нуури ваз-золаам
Йаа Роббат-тахиййати вассалаам
Йаа Роббал жалаали вал икроом
`,
  secondText:
    "Субхаанака йаа лаа илааа иллаа антал амаанал амаана холлиснаа минан-наар",
},
{
  id:28,
  firstText:"",
  javshantext:`
Йаа Имаада ман лаа имаада ла
Йаа Санада ман лаа санада ла
Йаа Зухра ман лаа зухра ла
Йаа Гыйааса ман лаа гыйааса ла
Йаа Хирза ман лаа хирза nah
Йаа Фахра ман лаа фахра ла
Йаа ЪИзза ман лаа фахра лаh
Йаа Муъиина ман лаа муъиина ла
Йаа Анииса ман лаа анииса ла
Йаа Гунйата ман лаа гунйата ла
`,
  secondText:
    "Субхаанака йаа лаа илааа иллаа антал амаанал амаана холлиснаа минан-наар",
},
{
  id:29,
  firstText:"Ва ас'алука би асмааика",
  javshantext:`
Йаа Кооим
Йаа Дааим
Йаа Роохим
Йаа Хааким
Йаа ЪАалим
Йаа ЪАасым
Йаа Коосим
Йаа Саалим
Йаа Кообид
Йаа Баасит
`,
  secondText:
    "Субхаанака йаа лаа илааа иллаа антал амаанал амаана холлиснаа минан-наар",
},
{
  id:30,
  firstText:"",
  javshantext:`
Йаа ЪАасыма-манистаьсама
Йаа Раахима манистархама
Йаа Наасыра манистансара
Йаа Хаафизо манистахфазо
Йаа Мукрима манистакрама
Йаа Муршида манистаршада
Йаа Муъиина манистаьаана
Йаа Мугииса манистагооса
Йаа Сариихо манистасрохо
Йаа Гоофиро манистагфаро
`,
  secondText:
    "Субхаанака йаа лаа илааа иллаа антал амаанал амаана холлиснаа минан-наар",
},
{
  id:31,
  firstText:"",
  javshantext:`
Йаа Кариимас-софхи
Йаа Азиимал манни
Йаа Касиирол хойр
Йаа Кодиимал фадл
Йаа Латыйфас-суньи
Йаа Дааимал-лутф
Йаа Наафисал карб
Йаа Каашифад-дурри
Йаа Мааликал мулк
Йаа Коодийан билхакк
`,
  secondText:
    "Субхаанака йаа лаа илааа иллаа антал амаанал амаана холлиснаа минан-наар",
},
{
  id:32,
  firstText:"",
  javshantext:`
Йаа Азиизан лаа йудоом
Йаа Латыйфан лаа йуроом
Йаа Рокиибан лаа йанаам
Йаа Кооиман лаа йафуут
Йаа Хаййан лаа йамуут
Йаа Маликан лаа йазуул
Йаа Баакыйан лаа йафнаа
Йаа ЪАалиман лаа йажхал
Йаа Сомадан лаа йутьам
Йаа Ковиййан лаа йудьаф
`,
  secondText:
    "Субхаанака йаа лаа илааа иллаа антал амаанал амаана холлиснаа минан-наар",
},
{
  id:33,
  firstText:"Ва ас'алука би асмааика",
  javshantext:`
Йаа Ваахид
Йаа Ваажид
Йаа Шаахид
Йаа Маажид
Йаа Роошид
Йаа Бааъис
Йаа Ваарис
Йаа Доорр
Йаа Наафиъ
Йаа Хаадии
`,
  secondText:
    "Субхаанака йаа лаа илааа иллаа антал амаанал амаана холлиснаа минан-наар",
},
{
  id:34,
  firstText:"",
  javshantext:`
Йаа Аъ  зому мин кулли азиим
Йаа Акраму мин кулли кариим
Йаа Архаму мин кулли рохиим
Йаа Ахкаму мин кулли хакиим
Йаа Аламу мин кулли алиим
Йаа Акдаму мин кулли кодиим
Йаа Акбару мин кулли кабиир
Йаа Ажаллу мин кулли жалиил
Йаа Ааззу мин кулли азииз
Йаа Алтафу мин кулли латыйф
`,
  secondText:
    "Субхаанака йаа лаа илааа иллаа антал амаанал амаана холлиснаа минан-наар",
},
{
  id:35,
  firstText:"",
  javshantext:`
Йаа ман хува фии вахдихии вафийй
Йаа ман хува фии вафааихии ковийй
Йаа ман хува фии кувватихии алийй
Йаа ман хува фии улуввихии корииб
Йаа ман хува фии курбихии латыйф
Йаа ман хува фии лутфихии шарииф
Йаа ман хува фии шарофихии азииз
Йаа ман хува фии иззатихии азиим
Йаа ман хува фии азоматихии мажиид
Йаа ман хува фии маждихии хамиид
`,
  secondText:
    "Субхаанака йаа лаа илааа иллаа антал амаанал амаана холлиснаа минан-наар",
},
{
  id:36,
  firstText:"",
  javshantext:`
Йаа Ман хува куллу шай'ин хоодыъун ла
Йаа Ман хува куллу шай'ин кааинун ла
Иаа Ман хува куллу шай'ин мавжудуун ла
Йаа Ман хува куллу шай'ин муниибун ла
Йаа Ман хува куллу шай'ин хооифун мин
Йаа Ман хува куллу шай'ин мусаббихун ла
Йаа Ман хува куллу шай'ин кооимун би
Йаа Ман хува куллу шай'ин хоошиун ла
Йаа Ман хува куллу шай'ин сааирун илай
Йаа ман хува куллу шай'ин хааликун иллаа важхаh
`,
  secondText:
    "Субхаанака йаа лаа илааа иллаа антал амаанал амаана холлиснаа минан-наар",
},
{
  id:37,
  firstText:"Ва ас'алука би асмааика",
  javshantext:`
Йаа Каафии  
Йаа Шаафии
Йаа Ваафии
Йаа Муъаафии
Йаа ЪАалии
Йаа Дааъии
Йаа Роодии
Йаа Коодии
Йаа Баакыйу
Йаа Хаадии
`,
  secondText:
    "Субхаанака йаа лаа илааа иллаа антал амаанал амаана холлиснаа минан-наар",
},
{
  id:38,
  firstText:"",
  javshantext:`
Йаа Ман лаа мафарро иллаа илай
Йаа Ман лаа мафзаьа иллаа илай
Иаа Ман лаа малжа-а иллаа илай
Йаа Ман лаа йутаваккалу иллаа алай
Йаа Ман лаа максода иллаа илай
Йаа Ман лаа манжа а иллаа илай
Йаа Ман лаа йургобу иллаа илай
Йаа Ман лаа йуъбаду иллаа иййаа
Йаа Ман лаа йустааану иллаа мин
Йаа Ман лаа хавла валаа кувата иллаа биh  
`,
  secondText:
    "Субхаанака йаа лаа илааа иллаа антал амаанал амаана холлиснаа минан-наар",
},
{
  id:39,
  firstText:"",
  javshantext:`
Йаа Хойрол мархуубиин
Йаа Хойрол матлуубиин
Йаа Хойрол маргуубиин
Йаа Хойрол мас'уулиин
Йаа Хойрол максуудиин
Йаа Хойрол мазкууриин
Йаа Хойрол машкууриин
Йаа Хойрол махбуубиин
Йаа Хойрол мунзилиин
Йаа Хойрол муста'нисиин 
`,
  secondText:
    "Субхаанака йаа лаа илааа иллаа антал амаанал амаана холлиснаа минан-наар",
},
{
  id:40,
  firstText:"",
  javshantext:`
Йаа Ман хува холако фасавваа
Йаа Ман хува коддаро фахадаа
Йаа Ман хува йакшифул-балваа
Йаа Ман хува иасмаъун-нажваа
Йаа Ман хува йункизул-горкоо
Йаа Ман хува йунжил-халкаа
Йаа Ман хува йашфил-мардоо
Йаа Ман хува амаата ва ахйаа
Йаа Ман хува адхака ва абкаа
Йаа Ман хува адолла ва ахдаа  
`,
  secondText:
    "Субхаанака йаа лаа илааа иллаа антал амаанал амаана холлиснаа минан-наар",
},
{
  id:41,
  firstText:"Ва ас'алука биасмааика",
  javshantext:`
Йаа Гоофир
Йаа Саатир
Йаа Коохир
Йаа Коодир
Йаа Наазыр
Йаа Фаатыр
Иаа Шаакир
Йаа Заакир
Йаа Наасыр
Йаа Жаабир  
`,
  secondText:
    "Субхаанака йаа лаа илааа иллаа антал амаанал амаана холлиснаа минан-наар",
},
{
  id:42,
  firstText:"",
  javshantext:`
Йаа Ман хува фил-барри вал-бахри сабиилуh
Йаа Ман хува фил-аафааки аайаату
Йаа Ман хува фил-аайаати бурхаану
Йаа Ман хува фил-мамаати кудрату
Йаа Ман хува фил-кубуури иззату
Йаа Ман хува фил-кыйаамати милкату
Иаа Ман хува фил-хисааби хайбату
Йаа Ман хува фил-миизаани кодооу
Йаа Ман хува фил-жаннати рахмату
Йаа Ман хува фин-наари азаабу  
`,
  secondText:
    "Субхаанака йаа лаа илааа иллаа антал амаанал амаана холлиснаа минан-наар",
},
{
  id:43,
  firstText:"",
  javshantext:`
Йаа Ман хува илайхи йахрабул-хооифуун
Йаа Ман хува илайхи йафзаъул-музнибуун
Иаа Ман хува илайхи йаксыдул-муниибуун
Йаа Ман хува илайхи иалжаул-аасуун
Йаа Ман хува илайхи йаргабуз-заахидуун
Йаа Ман хува фиихи йатмаул-хоотыуун
Йаа Ман хува йаста'нису бихил-муриидуун
Йаа Ман хува йафтахыру бихил-мухсинуун
Йаа ман хува алайхи иатаваккалулмутаваккилуун
Йаа ман хува йаскуну бихил-муукынуун  
`,
  secondText:
    "Субхаанака йаа лаа илааа иллаа антал амаанал амаана холлиснаа минан-наар",
},
{
  id:44,
  firstText:"",
  javshantext:`
Йаа Акробу мин кулли корииб
Йаа Ахаббу мин кулли хабииб
Йаа Азому мин кулли азиим
Йаа Аъаззу мин кулли азииз
Йаа Акваа мин кулли ковиий
Йаа Агнаа мин кулли гонийй
Йаа Ажваду мин кулли жаваад
Йаа Ар афу мин кулли роууф
Йаа Архаму мин кулли рохиим
Йаа Ажаллу мин кулли жалиил  
`,
  secondText:
    "Субхаанака йаа лаа илааа иллаа антал амаанал амаана холлиснаа минан-наар",
},
{
  id:45,
  firstText:"Ва а'салука биасмааика",
  javshantext:`
Йаа Корииб
Йаа Рокииб
Йаа Хабииб
Йаа Мужииб
Йаа Хасииб
Йаа Тобииб
Йаа Басыйр
Йаа Хобиир
Йаа Муниир
Йаа Мубиин
`,
  secondText:
    "Субхаанака йаа лаа илааа иллаа антал амаанал амаана холлиснаа минан-наар",
},
{
  id:46,
  firstText:"",
  javshantext:`
Йаа Гоолибан гойра маглууб
Йаа Соониъан гойра маснууь
Йаа Хооликон гойра махлуук
Йаа Мааликан гойра мамлуук
Йаа Коохиран гойра макхуур
Йаа Роофиъан гойра марфууъ
Йаа Хаафизон гойра махфууз
Йаа Наасыран гойра мансуур
Йаа Шаахидан гойра гооиб
Йаа Кориибан гойра баъиид  
`,
  secondText:
    "Субхаанака йаа лаа илааа иллаа антал амаанал амаана холлиснаа минан-наар",
},
{
  id:47,
  firstText:"",
  javshantext:`
Йаа Нууран-нуур
Йаа Мунаввиран-нуур
Йаа Мусоввиран-нуур
Йаа Хооликан-нуур
Йаа Мукоддиран-нуур
Йаа Мудаббиран-нуур
Йаа Нууран кобла кулли нуур
Йаа Нууран баъда кулли нуур
Йаа Нууран фавко кулли нуур
Йаа Нуран лайса мислахуу нуур  
`,
  secondText:
    "Субхаанака йаа лаа илааа иллаа антал амаанал амаана холлиснаа минан-наар",
},
{
  id:48,
  firstText:"",
  javshantext:`
Йаа Ман атооухуу шарииф
Йаа Ман филухуу латыйф
Йаа Ман лутфухуу мукиим
Йаа Ман ихсаанухуу кодиим
Йаа Ман ковлуху хакк
Йаа Ман ваъдухуу сыдк
Йаа Ман афвухуу фадл
Йаа Ман азабухуу адл
Йаа Ман зикрухуу хулв
Йаа ман унсухуу лазииз
`,
  secondText:
    "Субхаанака йаа лаа илааа иллаа антал амаанал амаана холлиснаа минан-наар",
},
{
  id:49,
  firstText:"Ва ас'алука биасмааика",
  javshantext:`
Йаа Мунаввил
Йаа Муфассыл
Йаа Мубаддил
Йаа Мусаххил
Йаа Музаллил
Йаа Муназзил
Йаа Мухаввил
Йаа Мужаммил
Йаа Мукаммил
Йаа Муфаддил
`,
  secondText:
    "Субхаанака йаа лаа илааа иллаа антал амаанал амаана холлиснаа минан-наар",
},
{
  id:50,
  firstText:"",
  javshantext:`
Йаа Ман йараа валаа йураа
Йаа Ман йахлуку валаа йухлак
Йаа Ман йахдии валаа йухдаа
Йаа Ман йухйии валаа йухйаа
Йаа Ман йутъиму валаа йутьам
Йаа Ман йужииру валаа йужаар
Йаа Ман йакдии валаа йукдоо алай
Йаа Ман йахкуму валаа йухкаму алай
Йаа Ман лам йалид ва лам йуулад
Ва лам йакун лахуу куфуван ахад
`,
  secondText:
    "Субхаанака йаа лаа илааа иллаа антал амаанал амаана холлиснаа минан-наар",
},
{
  id:51,
  firstText:"Аллахумма иннии ас'алука би асмааика",
  javshantext:`
`,
  secondText:
    "Субхаанака йаа лаа илааа иллаа антал амаанал амаана холлиснаа минан-наар",
},
{
  id:52,
  firstText:"Аллахумма иннии ас'алука би асмааика",
  javshantext:`
`,
  secondText:
    "Субхаанака йаа лаа илааа иллаа антал амаанал амаана холлиснаа минан-наар",
},
{
  id:53,
  firstText:"Аллахумма иннии ас'алука би асмааика",
  javshantext:`
`,
  secondText:
    "Субхаанака йаа лаа илааа иллаа антал амаанал амаана холлиснаа минан-наар",
},
{
  id:54,
  firstText:"Аллахумма иннии ас'алука би асмааика",
  javshantext:`
`,
  secondText:
    "Субхаанака йаа лаа илааа иллаа антал амаанал амаана холлиснаа минан-наар",
},
{
  id:55,
  firstText:"Аллахумма иннии ас'алука би асмааика",
  javshantext:`
`,
  secondText:
    "Субхаанака йаа лаа илааа иллаа антал амаанал амаана холлиснаа минан-наар",
},
{
  id:56,
  firstText:"Аллахумма иннии ас'алука би асмааика",
  javshantext:`
`,
  secondText:
    "Субхаанака йаа лаа илааа иллаа антал амаанал амаана холлиснаа минан-наар",
},
{
  id:57,
  firstText:"Аллахумма иннии ас'алука би асмааика",
  javshantext:`
`,
  secondText:
    "Субхаанака йаа лаа илааа иллаа антал амаанал амаана холлиснаа минан-наар",
},
{
  id:58,
  firstText:"Аллахумма иннии ас'алука би асмааика",
  javshantext:`
`,
  secondText:
    "Субхаанака йаа лаа илааа иллаа антал амаанал амаана холлиснаа минан-наар",
},
{
  id:59,
  firstText:"Аллахумма иннии ас'алука би асмааика",
  javshantext:`
`,
  secondText:
    "Субхаанака йаа лаа илааа иллаа антал амаанал амаана холлиснаа минан-наар",
},
{
  id:60,
  firstText:"Аллахумма иннии ас'алука би асмааика",
  javshantext:`
`,
  secondText:
    "Субхаанака йаа лаа илааа иллаа антал амаанал амаана холлиснаа минан-наар",
},
{
  id:61,
  firstText:"Аллахумма иннии ас'алука би асмааика",
  javshantext:`
`,
  secondText:
    "Субхаанака йаа лаа илааа иллаа антал амаанал амаана холлиснаа минан-наар",
},
{
  id:62,
  firstText:"Аллахумма иннии ас'алука би асмааика",
  javshantext:`
`,
  secondText:
    "Субхаанака йаа лаа илааа иллаа антал амаанал амаана холлиснаа минан-наар",
},
{
  id:63,
  firstText:"Аллахумма иннии ас'алука би асмааика",
  javshantext:`
`,
  secondText:
    "Субхаанака йаа лаа илааа иллаа антал амаанал амаана холлиснаа минан-наар",
},
{
  id:64,
  firstText:"Аллахумма иннии ас'алука би асмааика",
  javshantext:`
`,
  secondText:
    "Субхаанака йаа лаа илааа иллаа антал амаанал амаана холлиснаа минан-наар",
},
{
  id:65,
  firstText:"Аллахумма иннии ас'алука би асмааика",
  javshantext:`
`,
  secondText:
    "Субхаанака йаа лаа илааа иллаа антал амаанал амаана холлиснаа минан-наар",
},
{
  id:66,
  firstText:"Аллахумма иннии ас'алука би асмааика",
  javshantext:`
`,
  secondText:
    "Субхаанака йаа лаа илааа иллаа антал амаанал амаана холлиснаа минан-наар",
},
{
  id:67,
  firstText:"Аллахумма иннии ас'алука би асмааика",
  javshantext:`
`,
  secondText:
    "Субхаанака йаа лаа илааа иллаа антал амаанал амаана холлиснаа минан-наар",
},
{
  id:68,
  firstText:"Аллахумма иннии ас'алука би асмааика",
  javshantext:`
`,
  secondText:
    "Субхаанака йаа лаа илааа иллаа антал амаанал амаана холлиснаа минан-наар",
},
{
  id:69,
  firstText:"Аллахумма иннии ас'алука би асмааика",
  javshantext:`
`,
  secondText:
    "Субхаанака йаа лаа илааа иллаа антал амаанал амаана холлиснаа минан-наар",
},
{
  id:70,
  firstText:"Аллахумма иннии ас'алука би асмааика",
  javshantext:`
`,
  secondText:
    "Субхаанака йаа лаа илааа иллаа антал амаанал амаана холлиснаа минан-наар",
},
{
  id:71,
  firstText:"Аллахумма иннии ас'алука би асмааика",
  javshantext:`
`,
  secondText:
    "Субхаанака йаа лаа илааа иллаа антал амаанал амаана холлиснаа минан-наар",
},
{
  id:72,
  firstText:"Аллахумма иннии ас'алука би асмааика",
  javshantext:`
`,
  secondText:
    "Субхаанака йаа лаа илааа иллаа антал амаанал амаана холлиснаа минан-наар",
},
{
  id:73,
  firstText:"Аллахумма иннии ас'алука би асмааика",
  javshantext:`
`,
  secondText:
    "Субхаанака йаа лаа илааа иллаа антал амаанал амаана холлиснаа минан-наар",
},
{
  id:74,
  firstText:"Аллахумма иннии ас'алука би асмааика",
  javshantext:`
`,
  secondText:
    "Субхаанака йаа лаа илааа иллаа антал амаанал амаана холлиснаа минан-наар",
},
{
  id:75,
  firstText:"Аллахумма иннии ас'алука би асмааика",
  javshantext:`
`,
  secondText:
    "Субхаанака йаа лаа илааа иллаа антал амаанал амаана холлиснаа минан-наар",
},
{
  id:76,
  firstText:"Аллахумма иннии ас'алука би асмааика",
  javshantext:`
`,
  secondText:
    "Субхаанака йаа лаа илааа иллаа антал амаанал амаана холлиснаа минан-наар",
},
{
  id:77,
  firstText:"Аллахумма иннии ас'алука би асмааика",
  javshantext:`
`,
  secondText:
    "Субхаанака йаа лаа илааа иллаа антал амаанал амаана холлиснаа минан-наар",
},
{
  id:78,
  firstText:"Аллахумма иннии ас'алука би асмааика",
  javshantext:`
`,
  secondText:
    "Субхаанака йаа лаа илааа иллаа антал амаанал амаана холлиснаа минан-наар",
},
{
  id:79,
  firstText:"Аллахумма иннии ас'алука би асмааика",
  javshantext:`
`,
  secondText:
    "Субхаанака йаа лаа илааа иллаа антал амаанал амаана холлиснаа минан-наар",
},
{
  id:80,
  firstText:"Аллахумма иннии ас'алука би асмааика",
  javshantext:`
`,
  secondText:
    "Субхаанака йаа лаа илааа иллаа антал амаанал амаана холлиснаа минан-наар",
},
{
  id:82,
  firstText:"Аллахумма иннии ас'алука би асмааика",
  javshantext:`
`,
  secondText:
    "Субхаанака йаа лаа илааа иллаа антал амаанал амаана холлиснаа минан-наар",
},
{
  id:83,
  firstText:"Аллахумма иннии ас'алука би асмааика",
  javshantext:`
`,
  secondText:
    "Субхаанака йаа лаа илааа иллаа антал амаанал амаана холлиснаа минан-наар",
},
{
  id:84,
  firstText:"Аллахумма иннии ас'алука би асмааика",
  javshantext:`
`,
  secondText:
    "Субхаанака йаа лаа илааа иллаа антал амаанал амаана холлиснаа минан-наар",
},
{
  id:85,
  firstText:"Аллахумма иннии ас'алука би асмааика",
  javshantext:`
`,
  secondText:
    "Субхаанака йаа лаа илааа иллаа антал амаанал амаана холлиснаа минан-наар",
},
{
  id:86,
  firstText:"Аллахумма иннии ас'алука би асмааика",
  javshantext:`
`,
  secondText:
    "Субхаанака йаа лаа илааа иллаа антал амаанал амаана холлиснаа минан-наар",
},
{
  id:87,
  firstText:"Аллахумма иннии ас'алука би асмааика",
  javshantext:`
`,
  secondText:
    "Субхаанака йаа лаа илааа иллаа антал амаанал амаана холлиснаа минан-наар",
},
{
  id:88,
  firstText:"Аллахумма иннии ас'алука би асмааика",
  javshantext:`
`,
  secondText:
    "Субхаанака йаа лаа илааа иллаа антал амаанал амаана холлиснаа минан-наар",
},
{
  id:89,
  firstText:"Аллахумма иннии ас'алука би асмааика",
  javshantext:`
`,
  secondText:
    "Субхаанака йаа лаа илааа иллаа антал амаанал амаана холлиснаа минан-наар",
},
{
  id:90,
  firstText:"Аллахумма иннии ас'алука би асмааика",
  javshantext:`
`,
  secondText:
    "Субхаанака йаа лаа илааа иллаа антал амаанал амаана холлиснаа минан-наар",
},
{
  id:91,
  firstText:"Аллахумма иннии ас'алука би асмааика",
  javshantext:`
`,
  secondText:
    "Субхаанака йаа лаа илааа иллаа антал амаанал амаана холлиснаа минан-наар",
},
{
  id:92,
  firstText:"Аллахумма иннии ас'алука би асмааика",
  javshantext:`
`,
  secondText:
    "Субхаанака йаа лаа илааа иллаа антал амаанал амаана холлиснаа минан-наар",
},
{
  id:93,
  firstText:"Аллахумма иннии ас'алука би асмааика",
  javshantext:`
`,
  secondText:
    "Субхаанака йаа лаа илааа иллаа антал амаанал амаана холлиснаа минан-наар",
},
{
  id:94,
  firstText:"Аллахумма иннии ас'алука би асмааика",
  javshantext:`
`,
  secondText:
    "Субхаанака йаа лаа илааа иллаа антал амаанал амаана холлиснаа минан-наар",
},
{
  id:95,
  firstText:"Аллахумма иннии ас'алука би асмааика",
  javshantext:`
`,
  secondText:
    "Субхаанака йаа лаа илааа иллаа антал амаанал амаана холлиснаа минан-наар",
},
{
  id:96,
  firstText:"Аллахумма иннии ас'алука би асмааика",
  javshantext:`
`,
  secondText:
    "Субхаанака йаа лаа илааа иллаа антал амаанал амаана холлиснаа минан-наар",
},
{
  id:97,
  firstText:"Аллахумма иннии ас'алука би асмааика",
  javshantext:`
`,
  secondText:
    "Субхаанака йаа лаа илааа иллаа антал амаанал амаана холлиснаа минан-наар",
},
{
  id:98,
  firstText:"Аллахумма иннии ас'алука би асмааика",
  javshantext:`
`,
  secondText:
    "Субхаанака йаа лаа илааа иллаа антал амаанал амаана холлиснаа минан-наар",
},
{
  id:99,
  firstText:"Аллахумма иннии ас'алука би асмааика",
  javshantext:`
`,
  secondText:
    "Субхаанака йаа лаа илааа иллаа антал амаанал амаана холлиснаа минан-наар",
},
{
  id:100,
  firstText:"Аллахумма иннии ас'алука би асмааика",
  javshantext:`
`,
  secondText:
    "Субхаанака йаа лаа илааа иллаа антал амаанал амаана холлиснаа минан-наар",
}
];
export default JavDua