import React from "react";
import { Text, View, Image, ScrollView, Pressable } from "react-native";
import { gStyle } from "../Style/Style";
import Header from "./Header";
import SoundArea from "./SoundArea";
import HighlightText from "@sanar/react-native-highlight-text";

const audioTrack = require("../audio/Magrib.mp3");
const data = require("../Highlighted/highlighted.json");

export const Magrib = () => {
  const magribText = `Магриб намаздын парзы окулуп, салам берилгенден кийин:
  
"Аллоохумма антас-салааму ваминкас-салаам, табаарокта йаа зал-жалаали вал икроом" деп айтылат. 
  
Анан колдор көтөрулуп, алакандар жайылып "Солаатан тунжина" дубасы окулат:
  
"Аллоохумма солли 'алаа саййидинаа Мухаммадин ва 'алаа аали саййидинаа Мухаммад, солаатан тунжинаа бихаа мин жамии'ил ахваали вал аафаат.('аафаат' деп айтып жатканда алакан төмөн, бүткөндө өйдө каратылат.) Ва такдий ланаа бихаа жамии'ал хаажаат, ва тутоххирунаа бихаа мин жами'ис саййи-аат, ва тарфаунаа бихаа 'индака аа'лад дарожаат, ва тубаллигунаа бихаа аксоль гоойаат, мин жамии ил хойрооти фил хайаати ва баадал мамаат, аамиин,йа Мужибад да аваат, вал хамду лиллаахи Роббил "ааламиин" деп алакандар бетке сүрүлөт.  
  
Шам намазы буткондон кийин тасбихат улантылат:

"Аллоохумма иннаа нукаддиму илайка байна йаадай кулли нафасин ва ламхатин ва лахзотин ва торфатин атрифу бихаа ахлус-самааваати ва ахлул ародийна; Ашхаду ан...

(бул жерге чейин 1 жолу окулат)

Лаа илааха иллаллооху вахдахуу лаа шарийка лах, лахул-мулку валахул-хамд ва хува 'алаа кулли шай-ин кодиир"
(10 жолу окулуп, 10-нун аягында)
"ва илайхил-масыйр" (кошулат)

Истиаза дубалары окулат (колдор көтөрүлүп, алакандар төмөн каратылат):

*Аллоохумма ажирнаа минан-наар" (3, 5 же 7 жолу окулат)
*Аллоохумма ажирнаа мин кулли наар.
*Аллоохумма ажирнаа мин фитнатид-дииниййати вад-дунйавиййа.
*Аллоохумма ажирнаа мин фитнати аахириз замаан.
*Аллоохумма ажирнаа мин фитнатил масийхид-даж-жаали вас-суфиаан.
*Аллоохумма ажирнаа мин минад-долаалаати вал бид'ий-йаати вал балиййаат.
*Аллоохумма ажирнаа мин шаррин нафсил аммааро.
*Аллоохумма ажирнаа мин шуруурин нуфуусил аммаароотил фир'авниййа.
*Аллоохумма ажирнаа мин шаррин нисаа.
*Аллоохумма ажирнаа мин балла-ин нисаа.
*Аллоохумма ажирнаа мин фитнатин нисаа.
*Аллоохумма ажирнаа мин 'азаабил кобр.
*Аллоохумма ажирнаа мин 'азааби яумил кыйаама.
*Аллоохумма ажирнаа мин 'азааби жаханнам.
*Аллоохумма ажирнаа мин 'азааби кохрик.
*Аллоохумма ажирнаа мин наари кохрик.
*Аллоохумма ажирнаа мин азаабил кобри ван нийроон.
*Аллоохумма ажирнаа мин минар рийаа-и вас сум'ати вал ужуби вал фахр.
*Аллоохумма ажирнаа мин тажаавузил мулхидиин.
*Аллоохумма ажирнаа мин шаррил мунаафикиин.
*Аллоохумма ажирнаа мин фитнатил фаасикиин.
*Аллоохумма ажирнаа ва ажир ваалидайнаа ва толабата Росаа-илин нуурис-соодикийна фий хидматил кур-аани вал-иймаан, ва ахбаабанал му-миниинал мухлисыйна ва акрибаа-анаа ва аждааданаа минан наар. 
(ушул жерде алакандар жогору каратылат)

"Би 'афвика йаа Мужиир, бифадлика йаа Гоффаар. Аллоохумма адхилнал жанната ма'ал аброор". (Бул 3 жолу айтылат)

«Аллоохумма адхилнаа ва адхил устаазана ва ваалидайнаа ва толабата росаа-илин нуурис соодикийна ва ихваананаа ва аховаатанаа ва акрибаа-анаа ва аждааданаа ва ахбаабанал му-миниинал мухлисыйна фий хидматил иймаани вал кур-аан, ал жанната маал аброор, би шафааати набиййикал мухтаар ва аалихиил атхаар ва асхаабихил ахйаар васаллим маа даамал лайлу ван нахаар. Аамиин, вал хамду лиллаахи Роббил 'ааламиин».
(Алакандар бетке сүрүлөт.)

Анан намаздын аягындагы тасбихтерге өтөбуз:
  
«Субхааналлоохи вал хамду лиллаахи ва лаа илааха иллаллооху валлооху акбар, ва лаа хавла ва лаа куввата иллаа биллаахил 'алиййил 'азыйм" деп айтылат жана 'Аятал Курси' окулат:

Бисмиллаахир Рахмаанир Рахиим.

«Аллооху лаа илааха иллаа хувал хаййул каййуум, лаа та-хузухуу синатун валаа наум, лаху маа фиссамааваати вамаа фил ард, ман залазий йаашфау индахуу иллаа би-изних, йаа' ламу маа байна айдийхим вамаа холфахум валаа йухийтууна би шай-ин мин 'илмихии иллаа бимаа шаа-а, васи'а курсиййухус самааваати вал арди, валаа йа-уудуху хифзухума ва хувал' алиййул азыйм»

Намаз тасбихтери айтылат:

Субхааналлоох (33 жолу)

Алхамдулиллаах (33 жолу)

Аллооху акбар (33 жолу)

«Лаа илааха иллаллооху вахдахуу лаа шарийка лах, лахул мулку ва лахул хамду йухйии ва йумиит, ва хува хаййун лаа ямуут, биадихил хойр, ва хува 'алаа кулли шай-ин кодиир ва илайхил масыйр» деп айтылып дуба кылынат.

Дубадан кийинки тасбихат улантылат:

Фалам аннаху (1 жолу)

Лаа илааха иллаллоох
  
«Мухаммадун Расуулуллоохи соллаллооху та'аалаа 'алайхи ва саллам» (Андан сон):
  
Тасбихаттагы салаату-саламдар окулат:

Бисмиллаахир Рохмаанир Рахиим.

* Инналлооха ва малаа-икатахуу усоллууна 'алан набий, йаа аййухаллазийна аамануу соллууалайхи васаллимуу таслиймаа, лаббайк!.

* Аллоохумма солли 'алаа саййидинаа Мухаммадин ва 'алаа аали саййидинаа Мухаммад, би 'адади кулли даа-ин ва даваа-ин ва баарик васаллим 'алайхи ва 'алайхим касийроо.

* Аллоохумма солли 'алаа саййидинаа Мухаммадин ва 'алаа аали саййидинаа Мухаммад, би 'адади кулли даа-ин ва даваа-ин ва баарик васаллим 'алайхи ва алайхим касийроо.

* Аллоохумма солли 'алаа саййидинаа Мухаммадин ва 'алаа аали саййидинаа Мухаммад, би адади кулли даа-ин ва даваа-ин ва баарик васаллим 'алайхи ва алайхим касийрон касийроо.

* Солли васаллим йаа Робби 'алаа хабийбика Мухаммадин ва 'алаа жамии'ил анбийаа-и вал мурсалиин, ва 'алаа аали куллин ва сохби куллин ажмаин. Аамиин, вал хамду лиллаахи Роббил 'ааламиин.

* Алфу алфи солаатин ва алфу алфи салаамин 'алайка йаа расуулаллоох.

* Алфу алфи солаатин ва алфу алфи салаамин 'алайка йаа хабиибаллоох.

* Алфу алфи солаатин ва алфу алфи салаамин 'алайка йаа амиина вахйиллаах.

* Аллоохумма солли васаллим ва баарик, алаа саййидинаа Мухаммадин ва 'алаа аалихи ва асхаабих, би 'адади авроокил ашжаари ва амваажил бихаари ва катороотил амтоор, вагфир ланаа вархамнаа валтуф бинаа ва би устаазинаа ва ваалидайнаа ва битолабати росаа-илин нуурис-соодикиин, йаа илааханаа би кулли солаатин минхаа, ашхаду ан лаа илааха иллаллоох, ва ашхаду анна Мухаммадан Расуулуллоохи соллаллооху та'аала 'алайхи ва саллам.

Бисмиллаахир Рахмаанир Рахиим.
  
﻿﻿Иаа Жамиилу йаа Аллаах Иаа Кориибу йаа Аллаах

﻿﻿Йаа Мужиибу йаа Аллаах Йаа Хабиибу йаа Аллаах

﻿﻿Йаа Ро-ууфу йаа Аллаах Йаа 'Атууфу йаа Аллаах

﻿﻿Йаа Ма рууфу йаа Аллаах Йаа Латыйфу йаа Аллаах

﻿﻿Иаа Азыйму йаа Аллаах Йаа Ханнаану йаа Аллаах

﻿﻿Йаа Маннаану йаа Аллаах Йаа Даййаану йаа Аллаах

﻿﻿Йаа Субхаану йаа Аллаах Йаа Амаану йаа Аллаах

﻿﻿Йаа Бурхаану йаа Аллаах Йаа Султоону йаа Аллаах

﻿﻿Йаа Мустааану йаа Аллаах Йаа Мухсину йаа Аллаах

﻿﻿Йаа Мутааалу йаа Аллаах Йаа Рохмаану йаа Аллаах

﻿﻿Йаа Рохийму йаа Аллаах Йаа Карийму йаа Аллаах

﻿﻿Йаа Мажииду йаа Аллаах Йаа Фарду йаа Аллаах

﻿﻿Йаа Витру йаа Аллаах Йаа Ахаду йаа Аллаах

﻿﻿Иаа Сомаду йаа Аллаах Иаа Махмууду йаа Аллаах

﻿﻿Йаа Соодикал Ва'ди йаа Аллаах Йаа Алиййу йаа Аллаах

﻿﻿Йаа Гониййу йаа Аллаах Йаа Шаафий йаа Аллаах

﻿﻿Йаа Каафий йаа Аллаах Йаа Му/аафий йаа Аллаах

﻿﻿Йаа Баакий йаа Аллаах Йаа Хаадий йаа Аллаах

﻿﻿Йаа Коодиру йаа Аллаах Йаа Саатиру йаа Аллаах

﻿﻿Йаа Коххаару йаа Аллаах Йаа Жаббаару йаа Аллаах

﻿﻿Йаа Гоффаару йаа Аллаах Йаа Фаттааху йаа Аллаах
  
(Алакандан жогору каратылып, колдор көтөрүлөт)
  
«Йаа Роббас самааваати вал арди, иаа зал жалаали вал икроом, (н)ас-алука би хакки хаазихил асмаа-и куллихаа ан тусоллийа 'алаа саййидинаа Мухаммадин ва 'алаа аали Мухаммад, вархам Мухаммадан камаа соллайта ва салламта ва баарокта ва рохимта ва тароххамта 'алаа Ибрахийма ва 'алаа аали Ибрахийма фил ,ааламиин, Роббанаа иннака Хамийдун Мажиид, би рохматика йаа архамар роохимиин, вал хамду лиллаахи Роббил 'ааламиин».
  
«Хашр» суресунун 20-24 аяттары окулат:

Аъуузу биллаахи минаш - шайтоонир - рожиим.

«Бакара» суресунун акыркы 285-286-аяттары окулат:
  
«Лаа яставии асхаабун наари ва асхаабул жанна, асхаабул жаннати хумул фаа-изуун. Лау анзалнаа хаазал кур-аана 'алаа жабалин ларо-айтаху хооши'ан мутасоди'ан мин хошиатиллаах ва тилкал-амсаалу надрибухаа линнааси ла'аллахум ятафаккаруун. Хуваллоохуллазий лаа илааха иллаа хуу, 'Аалимул гойби вашшахаадати хувар Рохмаанур Рахиим. Хуваллоохуллазий лаа илааха иллаа хуу, ал Маликул Куддуусус Салаамул Му-минул Мухайминул Азийзул Жаббаарул Мутакаббир, Субхааналлоохи аммаа йушрикуун. Хуваллоохул Хооликул Баари'ул Мусоввиру лахул асмаа-ул хуснаа, йусаббиху лахуу маа фис самааваати вал-ард, ва хувал 'Азийзул Хакиим». СодакАллоохул 'Азыйм.
  `;
  return (
    <View>
      <View style={gStyle.header}>
        <Header title="МАГРИБ" />
      </View>
      <ScrollView style={{ backgroundColor: "#320548", padding: 18 }}>
        <View style={gStyle.container}>
          <Text style={[gStyle.tasbihatText, {fontFamily: 'Montserrat Medium'}]}>
            <HighlightText
              highlightStyle={{ color: "yellow" }}
              searchWords={data.highlighted}
              textToHighlight={magribText}
            />
          </Text>
        </View>
      </ScrollView>
      <View>
        <SoundArea audioTrack={audioTrack} />
      </View>
    </View>
  );
};
