import React from "react";
import { Text, View, ScrollView, StyleSheet } from "react-native";
import SoundArea from "../../atoms/players/SoundArea";
import HighlightText from "@sanar/react-native-highlight-text";

export const Isha = () => {
  const ishaText = `Иша намаздын парзы окулуп, салам берилгенден кийин:
  
"Аллоохумма антас-салааму ваминкас-салаам, табаарокта йаа зал-жалаали вал икроом" деп айтылат. 
  
Анан колдор көтөрулуп, алакандар жайылып "Солаатан тунжина" дубасы окулат:
  
"Аллоохумма солли 'алаа саййидинаа Мухаммадин ва 'алаа аали саййидинаа Мухаммад, солаатан тунжинаа бихаа мин жамии'ил ахваали вал аафаат.('аафаат' деп айтып жатканда алакан төмөн, бүткөндө өйдө каратылат.) Ва такдий ланаа бихаа жамии'ал хаажаат, ва тутоххирунаа бихаа мин жами'ис саййи-аат, ва тарфаунаа бихаа 'индака аа'лад дарожаат, ва тубаллигунаа бихаа аксоль гоойаат, мин жамии ил хойрооти фил хайаати ва баадал мамаат, аамиин,йа Мужибад да аваат, вал хамду лиллаахи Роббил "ааламиин" деп алакандар бетке сүрүлөт.  
  
Куптандын акыркы суннету жана Витир важиб окулгандан кийин:
  
«Субхааналлоохи вал хамду лиллаахи ва лаа илааха иллаллооху валлооху акбар, ва лаа хавла ва лаа куввата иллаа биллаахил 'алиййил 'азыйм" деп айтылат жана 'Аятал Курси' окулат:

Бисмиллаахир Рахмаанир Рахиим.

«Аллооху лаа илааха иллаа хувал хаййул каййуум, лаа та-хузухуу синатун валаа наум, лаху маа фиссамааваати вамаа фил ард, ман залазий йаашфау индахуу иллаа би-изних, йаа' ламу маа байна айдийхим вамаа холфахум валаа йухийтууна би шай-ин мин 'илмихии иллаа бимаа шаа-а, васи'а курсиййухус самааваати вал арди, валаа йа-уудуху хифзухума ва хувал' алиййул азыйм»

Намаз тасбихтери айтылат:

Субхааналлоох (33 жолу)

Алхамдулиллаах (33 жолу)

Аллооху акбар (33 жолу)

«Лаа илааха иллаллооху вахдахуу лаа шарийка лах, лахул мулку ва лахул хамду йухйии ва йумиит, ва хува хаййун лаа ямуут, биадихил хойр, ва хува 'алаа кулли шай-ин кодиир ва илайхил масыйр» деп айтылып дуба кылынат.

Дубадан кийинки тасбихат улантылат:

Фалам аннаху (1 жолу)

Лаа илааха иллаллоох
  
«Мухаммадун Расуулуллоохи соллаллооху та'аалаа 'алайхи ва саллам» (Андан сон):
  
Тасбихаттагы салаату-саламдар окулат:

Бисмиллаахир Рохмаанир Рахиим.

* Инналлооха ва малаа-икатахуу усоллууна 'алан набий, йаа аййухаллазийна аамануу соллууалайхи васаллимуу таслиймаа, лаббайк!.

* Аллоохумма солли 'алаа саййидинаа Мухаммадин ва 'алаа аали саййидинаа Мухаммад, би 'адади кулли даа-ин ва даваа-ин ва баарик васаллим 'алайхи ва 'алайхим касийроо.

* Аллоохумма солли 'алаа саййидинаа Мухаммадин ва 'алаа аали саййидинаа Мухаммад, би 'адади кулли даа-ин ва даваа-ин ва баарик васаллим 'алайхи ва алайхим касийроо.

* Аллоохумма солли 'алаа саййидинаа Мухаммадин ва 'алаа аали саййидинаа Мухаммад, би адади кулли даа-ин ва даваа-ин ва баарик васаллим 'алайхи ва алайхим касийрон касийроо.

* Солли васаллим йаа Робби 'алаа хабийбика Мухаммадин ва 'алаа жамии'ил анбийаа-и вал мурсалиин, ва 'алаа аали куллин ва сохби куллин ажмаин. Аамиин, вал хамду лиллаахи Роббил 'ааламиин.

* Алфу алфи солаатин ва алфу алфи салаамин 'алайка йаа расуулаллоох.

* Алфу алфи солаатин ва алфу алфи салаамин 'алайка йаа хабиибаллоох.

* Алфу алфи солаатин ва алфу алфи салаамин 'алайка йаа амиина вахйиллаах.

* Аллоохумма солли васаллим ва баарик, алаа саййидинаа Мухаммадин ва 'алаа аалихи ва асхаабих, би 'адади авроокил ашжаари ва амваажил бихаари ва катороотил амтоор, вагфир ланаа вархамнаа валтуф бинаа ва би устаазинаа ва ваалидайнаа ва битолабати росаа-илин нуурис-соодикиин, йаа илааханаа би кулли солаатин минхаа, ашхаду ан лаа илааха иллаллоох, ва ашхаду анна Мухаммадан Расуулуллоохи соллаллооху та'аала 'алайхи ва саллам.

Бисмиллаахир Рахмаанир Рахиим.
  
Иаа Жамиилу йаа Аллаах Иаа Кориибу йаа Аллаах

Йаа Мужиибу йаа Аллаах Йаа Хабиибу йаа Аллаах

Йаа Ро-ууфу йаа Аллаах Йаа 'Атууфу йаа Аллаах

Йаа Ма рууфу йаа Аллаах Йаа Латыйфу йаа Аллаах

Иаа Азыйму йаа Аллаах Йаа Ханнаану йаа Аллаах

Йаа Маннаану йаа Аллаах Йаа Даййаану йаа Аллаах

Йаа Субхаану йаа Аллаах Йаа Амаану йаа Аллаах

Йаа Бурхаану йаа Аллаах Йаа Султоону йаа Аллаах

Йаа Мустааану йаа Аллаах Йаа Мухсину йаа Аллаах

Йаа Мутааалу йаа Аллаах Йаа Рохмаану йаа Аллаах

Йаа Рохийму йаа Аллаах Йаа Карийму йаа Аллаах

Йаа Мажииду йаа Аллаах Йаа Фарду йаа Аллаах

Йаа Витру йаа Аллаах Йаа Ахаду йаа Аллаах

Иаа Сомаду йаа Аллаах Иаа Махмууду йаа Аллаах

Йаа Соодикал Ва'ди йаа Аллаах Йаа Алиййу йаа Аллаах

Йаа Гониййу йаа Аллаах Йаа Шаафий йаа Аллаах

Йаа Каафий йаа Аллаах Йаа Му/аафий йаа Аллаах

Йаа Баакий йаа Аллаах Йаа Хаадий йаа Аллаах

Йаа Коодиру йаа Аллаах Йаа Саатиру йаа Аллаах

Йаа Коххаару йаа Аллаах Йаа Жаббаару йаа Аллаах

Йаа Гоффаару йаа Аллаах Йаа Фаттааху йаа Аллаах
  
(Алакандан жогору каратылып, колдор көтөрүлөт)
  
«Йаа Роббас самааваати вал арди, иаа зал жалаали вал икроом, (н)ас-алука би хакки хаазихил асмаа-и куллихаа ан тусоллийа 'алаа саййидинаа Мухаммадин ва 'алаа аали Мухаммад, вархам Мухаммадан камаа соллайта ва салламта ва баарокта ва рохимта ва тароххамта 'алаа Ибрахийма ва 'алаа аали Ибрахийма фил ,ааламиин, Роббанаа иннака Хамийдун Мажиид, би рохматика йаа архамар роохимиин, вал хамду лиллаахи Роббил 'ааламиин».
  
«Фатх» сүрөсүнүн акыркы аяттары окулат:

Аъуузу биллаахи минаш - шайтоонир - рожиим.

«Бакара» суресунун акыркы 285-286-аяттары окулат:
  
«Ааманар расуулу бимаа унзила илайхи мир Роббихии вал му-минуун, куллун аамана биллаахи ва малааикатихии ва кутубихии ва русулих, лаа нуфаррику байна ахадим мир- усулих, ва вакоолуу сами'наа ва ато'наа, гуфроонака Роббанаа ва иляйкал масыйр. Лаа йукаллифуллооху нафсан иллаа вус'ахаа, лахаа маа касабат ва 'алайхаа мактасабат, Роббанаа лаа ту-аахизнаа ин насийнаа ав ахто-наа, Роббанаа ва лаа тахмил 'алайнаа исрон камаа хамалтахуу 'алал лазийна мин каблинаа, Роббанаа ва лаа тухаммилнаа маа лаа тоокота ланаа бих, ва'фу 'аннаа вагфир ланаа вархамнаа, анта Мавлаанаа фансурнаа 'алал ковмил каафириин».
  
СодакАллоохул 'Азыйм.
  
  `;
  const audioTrack = require("../../../assets/audio/Isha.mp3");
  const data = require("../../../assets/highlightedWords/highlighted.json");

  return (
    <View style={styles.isha}>
      <ScrollView>
        <View style={styles.container}>
          <Text style={styles.text}>
            <HighlightText
              highlightStyle={{ color: "#F2BB4A" }}
              searchWords={data.highlighted}
              textToHighlight={ishaText}
            />
          </Text>
        </View>
      </ScrollView>
      <View>
        <SoundArea audioTrack={audioTrack} />
      </View>
    </View>
  );
};

const styles = StyleSheet.create({
  isha: {
    width: "100%",
    height: "100%",
    backgroundColor: "#2E0A30",
  },
  container: {
    paddingHorizontal: 12,
    paddingVertical: 20,
    paddingBottom: 100,
  },
  text: {
    fontSize: 16,
    fontFamily: "Medium",
    lineHeight: 22,
    color: 'white'
  },
});
